{
  "title": "Arrival Lifts - Comprehensive Redesign and Rebuild of Arrival Lifts Website",
  "description": "This project aims to enhance the Arrival Lifts online presence, providing a visually appealing, functional, and professional website that effectively engages visitors and improves overall user experience.",
  "keywords": "HTML, CSS, TAILWIND, JS, Modern Redesign, web design, web development, responsive, website",
  "meta": {
    "ogTitle": "Arrival Lifts - Comprehensive Redesign and Rebuild of Arrival Lifts Website",
    "ogDesc": "This project aims to enhance the Arrival Lifts online presence, providing a visually appealing, functional, and professional website that effectively engages visitors and improves overall user experience.",
    "lang": "https://www.juanfernandes.uk/work/arrival-lifts/"
  },
  "intro": {
    "class": "",
    "heading": "Arrival Lifts",
    "subheading": "Website Redesign"
  },
  "details": {
    "client": "Arrival Lifts Ltd.",
    "role": "Website Designer",
    "tech": "HTML 11TY CSS TAILWIND JS CLOUDINARY",
    "url": ""
  },
  "project": {
    "heading": "Elevating a trusted brand with a modern, responsive web presence",
    "brief": " <h4>🎯 The Challenge</h4><p>Arrival Lifts' original website was dated, non-responsive, and lacked clarity in presenting their services. They needed a refreshed platform that could modernize their image, enhance usability, and meet evolving accessibility and SEO standards.</p><h4>🛠️ My Approach</h4><ul><li><strong>Modern, Responsive Design:</strong> Developed a clean layout that adapts across all screen sizes, using Tailwind CSS for efficiency and flexibility.</li><li><strong>Structured Content Layout:</strong> Defined a clear site structure—Home, Services, Projects, Clients, and Contact—to improve navigation and SEO.</li><li><strong>Enhanced Functionality:</strong> Integrated social media links, downloadable PDFs, and a revamped client list with testimonials to build trust.</li><li><strong>Optimized Performance and Accessibility:</strong> Delivered a fast-loading, SEO-optimized, and WCAG-friendly experience using 11ty.</li></ul><h4>📱 Outcomes</h4><ul><li>Fully responsive site adaptable to mobile, tablet, and desktop screens</li><li>Improved content clarity and site structure for better user engagement</li><li>Integrated trust-building elements like testimonials and client logos</li><li>Improved SEO and loading performance through static site generation</li><li>Accessibility compliance built into every component</li></ul><h4>💡 Why This Matters</h4><p>For many businesses, the website is the first impression. This project helped Arrival Lifts reestablish credibility, showcase their expertise, and grow trust through thoughtful design and smart web practices. It's proof that even traditional industries can benefit from great UX and modern frontend tooling.</p><blockquote>Juan delivered a website that truly represents our brand and services. The new design is not only visually appealing but also user-friendly and accessible. We've received positive feedback from clients and partners alike.<cite>Paul from Arrival Lifts Ltd.</cite></blockquote>"
  },
  "images": [
    {
      "img": "arrival-lifts-home.png",
      "alt": "Arrival Lifts Home Page"
    },
    {
      "img": "arrival-lifts-services.png",
      "alt": "Arrival Lifts Services Page"
    },
    {
      "img": "arrival-lifts-projects.png",
      "alt": "Arrival Lifts Projects Page"
    },
    {
      "img": "arrival-lifts-about.png",
      "alt": "Arrival Lifts About Page"
    },
    {
      "img": "arrival-lifts-contact.png",
      "alt": "Arrival Lifts Contact Page"
    }
  ]
}
