{
  "title": "Gratuu - Website Design and Development",
  "description": "This project aims to deliver a modern, user-friendly website that effectively showcases the client's product and information while providing easy content management and flexibility.",
  "keywords": "HTML, CSS, TAILWIND, JS, Modern Redesign, web design, web development, responsive, website",
  "meta": {
    "ogTitle": "Gratuu - Website Design and Development",
    "ogDesc": "This project aims to deliver a modern, user-friendly website that effectively showcases the client's product and information while providing easy content management and flexibility.",
    "lang": "https://www.juanfernandes.uk/work/gratuu/"
  },
  "intro": {
    "class": "",
    "heading": "Gratuu",
    "subheading": "Website Design & Development"
  },
  "details": {
    "client": "Gratuu Ltd",
    "role": "Website Designer",
    "tech": "HTML 11TY CSS TAILWIND JS CLOUDINARY",
    "url": "https://www.gratuu.com/"
  },
  "project": {
    "heading": "Building a modern, CMS-ready marketing site for a cashless tipping app",
    "brief": "<h4>🎯 The Challenge</h4><p>Gratuu, a fintech startup revolutionizing cashless tipping, required a sleek, responsive website to showcase its app and services. The goal was to create a four-page site—Homepage, About/How It Works, Contact, and Terms & Conditions—that effectively communicates the app's value proposition while being easy to manage and update.</p> <h4>🛠️ My Approach</h4><ul><li><strong>Homepage:</strong> Implemented an image carousel at the top to highlight key features, followed by introductory text with icons, a product screenshot scroller, a detailed app features section, and a \"Get in Touch\" contact area with social media links.</li><li><strong>About/How It Works Page:</strong> Featured a hero video section with call-to-action buttons, a compliance information section, and a contact area to provide users with comprehensive information about the app's functionality and benefits.</li><li><strong>Contact Page:</strong> Designed with a hero image and accompanying text, followed by a contact form, additional informational text, and social media icons to facilitate user engagement and inquiries.</li><li><strong>Terms & Conditions Page:</strong> Structured to present detailed terms and conditions text clearly and accessibly.</li><li><strong>Content Management:</strong> Ensured all sections are editable via a CMS by storing content in version-controlled markdown text files, providing flexibility and ease of updates without affecting the website's structure.</li><li><strong>Design Consistency:</strong> Integrated client-provided images and selected icons, adhering to existing color schemes and fonts to maintain brand consistency throughout the site.</li></ul><h4>📱 Outcomes</h4><ul><li>Delivered a fully responsive, four-page website that effectively showcases Gratuu's app and services.</li><li>Implemented a user-friendly CMS setup, allowing for easy content updates and management.</li><li>Enhanced user engagement through interactive elements like image carousels and a hero video section.</li><li>Maintained brand consistency by adhering to existing design elements and integrating client-provided assets.</li><li>Optimized website performance and accessibility, ensuring a seamless experience across devices.</li></ul><h4>💡 Why This Matters</h4><p>In the competitive fintech landscape, a compelling online presence is crucial. This project provided Gratuu with a modern, responsive website that not only reflects its innovative approach to cashless tipping but also offers an intuitive user experience. The CMS integration ensures that the Gratuu team can easily manage and update content, supporting ongoing marketing efforts and user engagement.</p>"
  },
  "images": [
    {
      "img": "gratuu-home",
      "alt": "Gratuu Home page"
    },
    {
      "img": "gratuu-howitworks",
      "alt": "Gratuu How It Works page"
    },
    {
      "img": "gratuu-contact",
      "alt": "Gratuu Contact page"
    },
    {
      "img": "gratuu-policy",
      "alt": "Gratuu Policy page"
    }
  ]
}
