{
  "title": "Lusso Prestige - Modern Website Design & Development for Vehicle Sales",
  "description": "This project aims to create a visually appealing, user-friendly, and highly functional website that effectively promotes vehicle sales and engages potential buyers.",
  "keywords": "HTML, CSS, TAILWIND, JS, Modern Redesign, web design, web development, responsive, website",
  "meta": {
    "ogTitle": "Lusso Prestige - Modern Website Design & Development for Vehicle Sales",
    "ogDesc": "This project aims to create a visually appealing, user-friendly, and highly functional website that effectively promotes vehicle sales and engages potential buyers.",
    "lang": "https://www.juanfernandes.uk/work/lusso-prestige/"
  },
  "intro": {
    "class": "",
    "heading": "Lusso Prestige",
    "subheading": "Website Design & Development"
  },
  "details": {
    "client": "Lusso Prestige Ltd.",
    "role": "Website Designer",
    "tech": "HTML PHP CSS CMS",
    "url": "https://www.lussoprestige.com/"
  },
  "project": {
    "heading": "Crafting a modern, responsive platform to showcase luxury, sports, and classic vehicles with enhanced user engagement",
    "brief": "<h4>🎯 The Challenge</h4><p>Lusso Prestige required a visually appealing, user-friendly, and highly functional website to effectively promote vehicle sales and engage potential buyers. The goal was to create a modern, responsive platform that showcases their inventory of luxury, sports, and classic cars, while integrating social media and email marketing tools.</p> <h4>🛠️ My Approach</h4><ul><li><strong>Homepage Design:</strong> Developed a clean and modern homepage featuring a large image slider promoting three featured vehicles, a responsive vehicle grid displaying 6-8 vehicles, an integrated Instagram feed, contact information, and a Mailchimp form for email subscriptions.</li><li><strong>Additional Pages:</strong> Created comprehensive pages including About Us, Sell Your Car, Inventory, Vehicle Detail, Previously Sold, and Contact Us, each designed to provide detailed information and facilitate user interaction.</li><li><strong>User Experience Enhancements:</strong> Implemented hover effects, sorting options, and detailed vehicle information pages to enhance user engagement and navigation.</li><li><strong>Integration:</strong> Fully integrated social media links and email marketing tools to expand the client's outreach and customer engagement.</li></ul><h4>📱 Outcomes</h4><ul><li>Delivered a modern, responsive website with a clean design and large images.</li><li>Enhanced user experience through intuitive navigation and interactive elements.</li><li>Improved customer engagement via integrated social media and email marketing tools.</li><li>Provided a scalable platform that effectively showcases the client's vehicle inventory.</li></ul><h4>💡 Why This Matters</h4><p>In the competitive market of luxury vehicle sales, a compelling online presence is crucial. This project successfully delivered a platform that not only showcases Lusso Prestige's offerings but also enhances user engagement and supports the client's marketing strategies.</p>"
  },
  "images": [
    {
      "img": "lusso-prestige-homepage.png",
      "alt": "Lusso Prestige Home page"
    },
    {
      "img": "lusso-prestige-stock.png",
      "alt": "Lusso Prestige Stock page"
    },
    {
      "img": "lusso-prestige-detail.png",
      "alt": "Lusso Prestige Vehicle Detail page"
    },
    {
      "img": "lusso-prestige-about.png",
      "alt": "Lusso Prestige About page"
    },
    {
      "img": "lusso-prestige-sellyourcar.png",
      "alt": "Lusso Prestige Sell Your Car page"
    },
    {
      "img": "lusso-prestige-contact.png",
      "alt": "Lusso Prestige Contact page"
    }
  ]
}
