{
  "title": "",
  "description": "",
  "keywords": "",
  "meta": {
    "ogTitle": "",
    "ogDesc": "",
    "lang": "https://www.juanfernandes.uk/work/"
  },
  "intro": {
    "class": "",
    "heading": "Lusso Prestige",
    "subheading": ""
  },
  "details": {
    "client": "Lusso Prestige Ltd.",
    "role": "Website Designer",
    "tech": "HTML PHP CSS CMS",
    "url": "https://www.lussoprestige.com/"
  },
  "project": {
    "heading": "Modern Website Design & Development for Vehicle Sales",
    "brief": "<h4>Objective:</h4><p>To design and develop a modern, responsive website for showcasing and selling vehicles. The website will feature a clean and crisp design with large images, ensuring optimal performance on smartphones, tablets, and desktop computers.</p> <h4>Scope of Work:</h4> <ol><li>Homepage:<ul><li><b>Image Slider:</b> Feature a large image slider promoting three featured vehicles for sale, each with a call-to-action section and a button link to the vehicle's detailed page.</li><li><b>Vehicle Grid:</b> Display 6-8 vehicles in a grid format on desktop, with the number reducing on smaller devices. Each vehicle entry will include the name, price, and a short description, linking to the vehicle's full page.</li><li><b>Instagram Feed:</b> Integrate an Instagram feed showcasing recent posts.</li><li><b>Contact Information:</b> Include contact details and links to social media pages.</li><li><b>Mailchimp Form:</b> Add a Mailchimp form for collecting email addresses for stock updates and future marketing campaigns.</li></ul></li><li>About Us Page:<ul><li>Provide information about the business, featuring a photo and possibly showcasing some personal vehicles to build a connection with potential buyers.</li></ul></li><li>Sell Your Car Page:<ul><li>Provide information for individuals looking to sell their cars, detailing the process, commissions, etc. This page will be similar in format to the About Us page.</li></ul></li><li>Inventory Page:<ul><li>Display all cars for sale in a grid format, similar to the homepage vehicle section. </li><li>Implement hover effects to indicate more information.</li><li>Enable sorting of vehicles by make, price (low/high), and other specified details.</li><li>Each vehicle entry will link to a detailed page with full information.</li></ul></li><li>Vehicle Detail Page:<ul><li>Feature a large image slider occupying one-third of the page, with vehicle technical specifications to the right.</li><li>Include detailed vehicle information below this section.</li><li>Provide a call-to-action button for inquiries and options to share the vehicle on social media.</li><li>Include contact information and navigation options to return to the inventory page or view the next/previous vehicle.</li></ul></li><li>Previously Sold Page:<ul><li>Similar in design to the inventory page but without links to detailed pages and without prices.</li></ul></li><li>Contact Us Page:<ul><li>Include a contact form, email address, telephone number, and postal address.</li><li>Optionally feature a map of the location and information about booking viewings if applicable.</li></ul></li></ol> <h4>Deliverables:</h4> <ul><li>A modern, responsive website with a clean design and large images.</li><li>A homepage with a featured vehicle slider, vehicle grid, Instagram feed, contact information, and Mailchimp form.</li><li>Additional pages: About Us, Sell Your Car, Inventory, Vehicle Detail, Previously Sold, and Contact Us.</li><li>Enhanced user experience with hover effects, sorting options, and detailed vehicle information pages.</li><li>Full integration with social media and email marketing tools.</li></ul><p>This project aims to create a visually appealing, user-friendly, and highly functional website that effectively promotes vehicle sales and engages potential buyers.</p>"
  },
  "images": [
    {
      "img": "lusso-prestige-homepage.png",
      "alt": "Lusso Prestige Home page"
    },
    {
      "img": "lusso-prestige-stock.png",
      "alt": "Lusso Prestige Stock page"
    },
    {
      "img": "lusso-prestige-detail.png",
      "alt": "Lusso Prestige Vehicle Detail page"
    },
    {
      "img": "lusso-prestige-about.png",
      "alt": "Lusso Prestige About page"
    },
    {
      "img": "lusso-prestige-sellyourcar.png",
      "alt": "Lusso Prestige Sell Your Car page"
    },
    {
      "img": "lusso-prestige-contact.png",
      "alt": "Lusso Prestige Contact page"
    }
  ]
}
