{
  "title": "Property With Potential - Modern Redesign of Landing and Results Pages",
  "description": "This project aims to significantly improve the current website's mobile experience, accessibility, and overall performance using advanced design and coding techniques.",
  "keywords": "HTML, CSS, TAILWIND, JS, Modern Redesign, web design, web development, responsive, website",
  "meta": {
    "ogTitle": "Property With Potential - Modern Redesign of Landing and Results Pages",
    "ogDesc": "This project aims to significantly improve the current website's mobile experience, accessibility, and overall performance using advanced design and coding techniques.",
    "lang": "https://www.juanfernandes.uk/work/property-with-potential/"
  },
  "intro": {
    "class": "",
    "heading": "Property With Potential",
    "subheading": "Website Redesign"
  },
  "details": {
    "client": "Property With Potential Ltd.",
    "role": "Website Designer",
    "tech": "HTML CSS TAILWIND JS",
    "url": "https://propertytorenovate.co.uk/"
  },
  "project": {
    "heading": "Enhancing mobile experience and user engagement through modern design and performance optimization",
    "brief": "<h4>🎯 The Challenge</h4><p>The client sought a comprehensive redesign of the landing and results pages to improve mobile responsiveness, user engagement, and overall performance. The goal was to create a modern, stylish, and reusable design that could be extended to other sections of the website, enhancing user experience (UX) and performance across devices.</p><h4>🛠️ My Approach</h4><ul><li><strong>Design and Development:</strong> Created new, modern, and stylish designs for the landing and results pages using standards-compliant HTML and a templating language. Adopted a component/modular approach for maximum code reusability and utilized the Tailwind CSS framework for customizable components and future scalability.</li><li><strong>Responsiveness:</strong> Ensured templates were responsive by employing a mobile-first design strategy. Redesigned the filters UI to enhance usability and accessibility, particularly on small screens, and optimized the homepage layout to boost user engagement with various website sections.</li><li><strong>Performance and Usability:</strong> Implemented mock design modules for in-content advertising. Improved code quality and utilized modern coding techniques to enhance accessibility and usability, focusing on creating error-free, high-performance templates that ensure fast loading and responsive interactions on both mobile and larger screen devices.</li></ul><h4>📱 Outcomes</h4><ul><li>Delivered new landing and results page templates with a modern design.</li><li>Implemented responsive design with a mobile-first approach.</li><li>Enhanced filters UI for better usability and accessibility.</li><li>Reordered homepage content for increased user interaction.</li><li>Created mock design modules for advertising integration.</li><li>Developed a high-performance, standards-compliant, and reusable codebase.</li></ul><h4>💡 Why This Matters</h4><p>This project significantly improved the website's mobile experience, accessibility, and overall performance using advanced design and coding techniques. The modern, reusable design enhances user engagement and can be extended to other sections of the website, providing long-term value to the client.</p>"
  },
  "testimonial": {
    "quote": "I asked Juan to redesign Property With Potential with the intent of improving the mobile experience and increasing user engagement. However, I needed <b>more than just a designer</b> since I wanted it delivered in a templating language that was compatible with our system, and to use Tailwind CSS. Juan rose to the challenge, learning Tailwind, introducing me to Alpine JS, and continuously delivering to Netlify and GitLab. There's nothing better as a developer than to work with someone that just 'gets it'; someone who can collaborate, work independently, and deliver. The new design has <b>significantly improved our performance</b> and <b>accessibility metrics</b>, and improved our ad revenue. If you need someone to hit the ground running and work with your existing team, <b>hire him</b>.",
    "cite": "Jon Canning",
    "img": "/v1617039926/jon-canning.jpg",
    "company": "Property With Potential"
  },
  "images": [
    {
      "img": "property-with-potential-homepage",
      "alt": "Home page screenshot"
    },
    {
      "img": "property-with-potential-about",
      "alt": "About page screenshot"
    },
    {
      "img": "property-with-potential-details",
      "alt": "Details page with screenshot"
    },
    {
      "img": "property-with-potential-details-map",
      "alt": "Details page with map screenshot"
    }
  ]
}
