{
  "title": "Redesign of Surbiton Tyre and Wheel Website",
  "description": "This project aims to transform the Surbiton Tyre and Wheel website into a high-performing, user-friendly platform with improved SEO and a seamless mobile experience.",
  "keywords": "HTML, CSS, TAILWIND, JS, Modern Redesign, web design, web development, responsive, website",
  "meta": {
    "ogTitle": "Redesign of Surbiton Tyre and Wheel Website",
    "ogDesc": "",
    "lang": "https://www.juanfernandes.uk/work/surbiton-tyre-wheel/"
  },
  "intro": {
    "class": "",
    "heading": "Surbiton Tyre & Wheel",
    "subheading": ""
  },
  "details": {
    "client": "Surbiton Tyre & Wheel Ltd.",
    "role": "Frontend Developer",
    "tech": "HTML 11TY CSS TAILWIND JS CLOUDINARY",
    "url": "https://www.surbitontyreandwheel.co.uk/"
  },
  "project": {
    "heading": "Redesign of Surbiton Tyre and Wheel Website",
    "brief": "<h4>Objective:</h4> <p class=\"lead\">To redesign the Surbiton Tyre and Wheel website, creating a modern, user-friendly, and SEO-optimized online presence. The project will enhance content organization, performance, and mobile responsiveness.</p> <h4>Scope of Work:</h4> <ol><li>Pages to be Built: <ul><li><b>Main Pages:</b> Home, Wheels > Brand page, Wheels > Wheel Refurbishment, Tyres > Brand page</li> <li><b>Additional Pages:</b> Batteries, Mobile Fitting, Accessories, TPMS, Fleet, Gallery, About</li></ul></li><li>Design and Content: <ul><li>Develop a brand-new, modern design for the entire website.</li><li>Re-organize existing content to improve usability and SEO.</li><li>Implement redirects for all changed page addresses to maintain SEO integrity.</li><li>Enhance content as part of the restructuring process to boost SEO where appropriate.</li></ul></li><li>Navigation and Homepage: <ul><li>Restructure the main navigation to align with the new website structure.</li><li>Design a new homepage featuring an image slider, heading, content, and links to promote other pages and products.</li></ul></li><li>Content Management System (CMS): <ul><li>Set up a new CMS to replace the current WordPress system, reducing the need for extensive maintenance and enhancing security.</li><li>Ensure the new CMS allows for easy editing and creation of pages, providing flexibility without needing developer assistance.</li></ul></li><li>Performance and Usability: <ul><li>Utilize modern coding techniques to improve code quality, accessibility, and usability (UX).</li><li>Enhance the mobile website experience using advanced responsive design methods.</li><li>Ensure the new website is error-free, loads quickly, and is highly responsive on both mobile and larger screen devices.</li></ul></li><li>SEO and Accessibility: <ul><li>Implement SEO best practices, including the addition of meta tags for better search engine information.</li><li>Focus on improving website accessibility and user experience through refined coding practices.</li></ul></li></ol><h4>Deliverables:</h4> <ul><li>A redesigned, modern website with the specified pages.</li><li>Improved content organization and SEO optimization.</li><li>Restructured main navigation and enhanced homepage.</li><li>Enhanced mobile and desktop performance and usability.</li><li>Full editing capabilities for all pages and easy creation of new pages.</li></ul> <p>This project aims to transform the Surbiton Tyre and Wheel website into a high-performing, user-friendly platform with improved SEO and a seamless mobile experience.</p>"
  },
  "images": [
    {
      "img": "surbiton-tyre-wheel-homepage",
      "alt": "Surbiton Tyre and Wheel homepage screenshot"
    },
    {
      "img": "surbiton-tyre-wheel-wheeldetail",
      "alt": "Surbiton Tyre and Wheel wheel detail page screenshot"
    },
    {
      "img": "surbiton-tyre-wheel-tyredetail",
      "alt": "Surbiton Tyre and Wheel tyre detail page screenshot"
    },
    {
      "img": "surbiton-tyre-wheel-wheelalignment",
      "alt": "Surbiton Tyre and Wheel content page screenshot"
    },
    {
      "img": "surbiton-tyre-wheel-tyrecare",
      "alt": "Surbiton Tyre and Wheel content page screenshot"
    },
    {
      "img": "surbiton-tyre-wheel-gallery",
      "alt": "Surbiton Tyre and Wheel gallery page screenshot"
    },
    {
      "img": "surbiton-tyre-wheel-contact",
      "alt": "Surbiton Tyre and Wheel contact page screenshot"
    }
  ]
}








