{
  "title": "Redesign of Surbiton Tyre and Wheel Website",
  "description": "This project aims to transform the Surbiton Tyre and Wheel website into a high-performing, user-friendly platform with improved SEO and a seamless mobile experience.",
  "keywords": "HTML, CSS, TAILWIND, JS, Modern Redesign, web design, web development, responsive, website",
  "meta": {
    "ogTitle": "Redesign of Surbiton Tyre and Wheel Website",
    "ogDesc": "",
    "lang": "https://www.juanfernandes.uk/work/surbiton-tyre-wheel/"
  },
  "intro": {
    "class": "",
    "heading": "Surbiton Tyre & Wheel",
    "subheading": "Website Redesign"
  },
  "details": {
    "client": "Surbiton Tyre & Wheel Ltd.",
    "role": "Frontend Developer",
    "tech": "HTML 11TY CSS TAILWIND JS CLOUDINARY",
    "url": "https://www.surbitontyreandwheel.co.uk/"
  },
  "project": {
    "heading": "Transforming a legacy site into a modern, user-friendly platform with improved SEO and mobile responsiveness",
    "brief": "<h4>🎯 The Challenge</h4><p>Surbiton Tyre & Wheel's existing website was outdated, difficult to navigate, and lacked mobile responsiveness. The client sought a complete redesign to modernize the site's appearance, improve user experience, enhance SEO, and ensure seamless performance across all devices.</p><h4>🛠️ My Approach</h4><ul><li><strong>Comprehensive Redesign:</strong> Developed a brand-new, modern design for the entire website, focusing on usability and visual appeal.</li><li><strong>Content Reorganization:</strong> Re-structured existing content to improve navigation and SEO, ensuring information is easily accessible to users.</li><li><strong>Navigation and Homepage Enhancement:</strong> Redesigned the main navigation and homepage to feature an image slider, clear headings, and links promoting other pages and products.</li><li><strong>CMS Integration:</strong> Replaced the existing WordPress system with a new CMS, allowing for easy editing and creation of pages without extensive maintenance.</li><li><strong>Performance Optimization:</strong> Utilized modern coding techniques to enhance code quality, accessibility, and user experience, ensuring fast load times and responsiveness on all devices.</li><li><strong>SEO and Accessibility Improvements:</strong> Implemented SEO best practices, including meta tags, and focused on improving website accessibility to reach a broader audience.</li></ul><h4>📱 Outcomes</h4><ul><li>Delivered a fully responsive, modern website that enhances user experience across all devices.</li><li>Improved content organization and navigation, making information easily accessible.</li><li>Enhanced SEO performance, increasing the site's visibility in search engine results.</li><li>Integrated a user-friendly CMS, allowing the client to manage content effortlessly.</li><li>Optimized website performance, ensuring fast load times and high accessibility standards.</li></ul><h4>💡 Why This Matters</h4><p>In today's digital landscape, a company's website serves as a critical touchpoint for customers. This project transformed Surbiton Tyre & Wheel's online presence, providing a modern, efficient, and accessible platform that meets the needs of their diverse customer base and supports their business growth.</p>"
  },
  "images": [
    {
      "img": "surbiton-tyre-wheel-homepage",
      "alt": "Surbiton Tyre and Wheel homepage screenshot"
    },
    {
      "img": "surbiton-tyre-wheel-wheeldetail",
      "alt": "Surbiton Tyre and Wheel wheel detail page screenshot"
    },
    {
      "img": "surbiton-tyre-wheel-tyredetail",
      "alt": "Surbiton Tyre and Wheel tyre detail page screenshot"
    },
    {
      "img": "surbiton-tyre-wheel-wheelalignment",
      "alt": "Surbiton Tyre and Wheel content page screenshot"
    },
    {
      "img": "surbiton-tyre-wheel-tyrecare",
      "alt": "Surbiton Tyre and Wheel content page screenshot"
    },
    {
      "img": "surbiton-tyre-wheel-gallery",
      "alt": "Surbiton Tyre and Wheel gallery page screenshot"
    },
    {
      "img": "surbiton-tyre-wheel-contact",
      "alt": "Surbiton Tyre and Wheel contact page screenshot"
    }
  ]
}








