[
    {
        "month": "January",
        "links": [
            {
                "title": "Expanding Grid Cards with View Transitions - Chris Coyier",
                "excerpt": "A friend showed me something of a design spec they were charged with pulling off: The requirements: &#8230; when I click on any of them it expands at the top to full width and the rest of the cards…",
                "url": "https://chriscoyier.net/2023/04/11/expanding-grid-cards-with-view-transitions/",
                "date": "January 6, 2024 at 08:30AM"
            },
            {
                "title": "CSS Custom Properties Beyond the :root - Matthias Ott",
                "excerpt": "Is there a good reason why we’re defining global custom properties on :root/html and not on body?",
                "url": "https://matthiasott.com/notes/custom-properties-beyond-the-root",
                "date": "January 6, 2024 at 08:37AM"
            },
            {
                "title": "A few developer console tricks",
                "excerpt": "In my new free course for beginners, Learn JavaScript, I talk briefly about how powerful the developer console is, and why I think it&rsquo;s ones of the best features of working in the front end.",
                "url": "https://gomakethings.com/a-few-developer-console-tricks/",
                "date": "January 6, 2024 at 08:39AM"
            },
            {
                "title": "Is It Time To Replace Sass? - Stephanie Eckles",
                "excerpt": "With the growth of native CSS features - including nesting - what features do we still gain by using Sass, and what is available to use in its place?",
                "url": "https://thinkdobecreate.com/articles/is-it-time-to-replace-sass/",
                "date": "January 8, 2024 at 10:59PM"
            },
            {
                "title": "Batching Life Changes",
                "excerpt": "I’ve never really done a “year in review” post before, but 2023 and, in particular, the last few months, have brought tides of change that I feel the need to share",
                "url": "https://chrisburnell.com/article/batching-life-changes/",
                "date": "January 8, 2024 at 11:05PM"
            },
            {
                "title": "CSS { In Real Life } | How Do You Vertically Centre an Element in CSS? (Even More) Easily!",
                "excerpt": "Rachel Andrew shared a snippet of good news for CSS layout on her blog the other day: it’ll soon be possible to vertically centre an element inside a parent without the parent needing to be a flex or grid container, using the align-content property.",
                "url": "https://css-irl.info/how-do-you-vertically-centre-an-element-in-css/",
                "date": "January 12, 2024 at 11:12PM"
            },
            {
                "title": "A CSS native way to prevent orphan text",
                "excerpt": "In typography, an orphan or widow is a single word on its own line. It can look particularly unpleasing with headings, and is hard to &ldquo;plan for&rdquo; on the web, where people view your site on a wide range of viewport sizes. You can avoid them by manually added a non-breaking space (&amp;nbsp;) before the second and last word in every sentence, but doing that manually is madness. &lt;h2&gt;How to use the Array.",
                "url": "https://gomakethings.com/a-css-native-way-to-prevent-orphan-text/",
                "date": "January 12, 2024 at 11:14PM"
            },
            {
                "title": "Minutes to Midnight - Giving context to a blogroll",
                "excerpt": "Garrit Franke’s recent post, titled “Roast my site”, motivated me to write about something that has always bugged me with personal sites: the grocery-style blogroll",
                "url": "https://minutestomidnight.co.uk/blog/giving-context-to-a-blogroll/",
                "date": "January 12, 2024 at 11:17PM"
            },
            {
                "title": "Local link targets must be focusable to prevent accessibility issues",
                "excerpt": "If you&#x27;re linking to local elements via id you must ensure that they are focusable because otherwise assistive technology relying on &#x22;document.activeElement&#x22; can&#x27;t follow the link target.",
                "url": "https://www.stefanjudis.com/today-i-learned/relative-html-links-focus-issues/",
                "date": "January 13, 2024 at 11:56PM"
            },
            {
                "title": "Exposed RSS",
                "excerpt": "I get sites not having an &#8220;RSS&#8221; for &#8220;Feed&#8221; link on their website while actually having an RSS feed. I don&#8217;t like it, but I get it. Maybe they picked an off-the-shelf t…",
                "url": "https://chriscoyier.net/2024/01/13/exposed-rss/",
                "date": "January 14, 2024 at 12:01AM"
            },
            {
                "title": "Using abbr Element with title Attribute",
                "excerpt": "How the &lt;abbr&gt; element is defined and exposed, along with the title attribute: § 4.5.9 The abbr element from WHATWG. ARIA in HTML entry on &lt;abbr&gt; notes it has no implicit role and naming is prohibited. Which is probably why Core Accessibility API Mappings 1.2 does not list it. HTML&hellip;",
                "url": "https://adrianroselli.com/2024/01/using-abbr-element-with-title-attribute.html",
                "date": "January 15, 2024 at 11:23PM"
            },
            {
                "title": "Sharing links",
                "excerpt": "The amount of content on the web is so large, that it's tricky to find the stuff worth reading. One of my strategies is to follow people I trust and read what they share.",
                "url": "https://hidde.blog/sharing-links/",
                "date": "January 15, 2024 at 11:28PM"
            },
            {
                "title": "The gotchas of CSS Nesting - Kilian Valkhof",
                "excerpt": "I've written before about the problems you can run into with CSS nesting and the question that @ChallengeCSS tweeted out today made me realize there's actually a few more gotcha's.",
                "url": "https://kilianvalkhof.com/2023/css-html/the-gotchas-of-css-nesting/",
                "date": "January 16, 2024 at 11:50PM"
            },
            {
                "title": "Testing My Eleventy-Website With Cypress and Netlify › Martin Schneider — Frontend Developer",
                "excerpt": "Last time I wrote &quot;this page is a repository consisting of some thrown-together and latenight-written code&quot;. Some tests should ensure that I don&#39;t break to much when I&#39;m, cleaning up the code. Here&#39;s how I created a basic setup that runs my tests before every deployment.",
                "url": "https://martinschneider.me/articles/testing-my-eleventy-website-with-cypress-and-netlify/",
                "date": "January 17, 2024 at 08:48AM"
            },
            {
                "title": "Fetching Webmentions With Netlify and Eleventy Edge › Martin Schneider — Frontend Developer",
                "excerpt": "Sadly, I&#39;m not too good at documenting what I&#39;m sometimes building in the little free time that I have. At the end of last year, I implemented an interesting feature on this site, but never wrote about it.",
                "url": "https://martinschneider.me/articles/fetching-webmentions-with-netlify-and-eleventy-edge/",
                "date": "January 17, 2024 at 10:44PM"
            },
            {
                "title": "Creating Scroll-Triggered Animations by combining Scroll-Driven Animations, Custom Properties, Style Queries, and Transitions",
                "excerpt": "When you combine Scroll-Driven Animations with Custom Properties, Style Queries, and Transitions you hack your way into creating Scroll-Triggered Animations.",
                "url": "https://www.bram.us/2023/06/15/scroll-triggered-animations/",
                "date": "January 17, 2024 at 10:55PM"
            },
            {
                "title": "6 Quick tests you can do to test your forms for accessibility - Karl Groves",
                "excerpt": "Whenever I do a full audit for a website, I have almost 40 individual, highly granular, form-related checks. Those checks can be boiled down to the following 6 high level goals.",
                "url": "https://karlgroves.com/6-quick-tests-you-can-do-to-test-your-forms-for-accessibility/",
                "date": "January 17, 2024 at 11:00PM"
            },
            {
                "title": "Time to First Byte: What it is and How to Make Improvements - Calibre",
                "excerpt": "TTFB is the backbone of page speed: it can make or break the experience of your sites. Learn how to test and  track it.",
                "url": "https://calibreapp.com/blog/time-to-first-byte",
                "date": "January 19, 2024 at 08:37AM"
            },
            {
                "title": "Bulletproofing your CMS - Nic Chan",
                "excerpt": "Help your future self by making sure your CMS can take anything clients throw at it.",
                "url": "https://www.nicchan.me/blog/bulletproofing-your-cms/",
                "date": "January 22, 2024 at 11:51PM"
            },
            {
                "title": "12 Modern CSS One-Line Upgrades - Modern CSS Solutions",
                "excerpt": "Sometimes, improving your application CSS just takes a one-line upgrade or enhancement! Learn about 12 properties to start incorporating into your projects, and enjoy reducing technical debt, removing JavaScript, and scoring easy wins for user experience.",
                "url": "https://moderncss.dev/12-modern-css-one-line-upgrades/",
                "date": "January 22, 2024 at 11:53PM"
            },
            {
                "title": "Better form UX with the CSS property `field-sizing` - Stephanie Stimac's Blog",
                "excerpt": "A look at the `field-sizing` CSS property and how it could improve web form user experience.",
                "url": "https://blog.stephaniestimac.com/posts/2024/01/css-field-sizing/",
                "date": "January 23, 2024 at 11:45PM"
            },
            {
                "title": "Progressively enhancing a link into a button with vanilla JavaScript",
                "excerpt": "In yesterday&rsquo;s article on loading HTML from another page, I talked about progressively enhancing a link into a button. Let’s imagine you have a dialog modal that loads some HTML. You might keep all that HTML in a separate file, and by default display a link to it. &lt;a href=&#34;/terms&#34;&gt;Read the Terms of Service&lt;/a&gt;  When your JS loads, you can progressively enhance it into a modal toggle.",
                "url": "https://gomakethings.com/progressively-enhancing-a-link-into-a-button-with-vanilla-javascript/",
                "date": "January 23, 2024 at 11:48PM"
            },
            {
                "title": "5 key design system elements to build trust and maximise uptake",
                "excerpt": "Since 2016 I’ve used, created and contributed to multiple design systems. I’ve seen what works and what doesn’t. By “doesn’t” I mean designers don’t trust it. And as a result they don’t use it",
                "url": "https://adamsilver.io/blog/5-key-design-system-elements-to-build-trust-and-maximise-uptake/",
                "date": "January 24, 2024 at 11:14PM"
            },
            {
                "title": "A quick introduction to CSS @scope",
                "excerpt": "An introductory thread to CSS @scope.",
                "url": "https://www.bram.us/2023/08/22/a-quick-introduction-to-css-scope",
                "date": "January 24, 2024 at 11:20PM"
            },
            {
                "title": "Positioning anchored popovers",
                "excerpt": "Popovers are in the top layer, how can we position them relative to invokers that are not?",
                "url": "https://hidde.blog/positioning-anchored-popovers/",
                "date": "January 30, 2024 at 01:32PM"
            },
            {
                "title": "CSS { In Real Life } | Reducing Complexity in Front End Development",
                "excerpt": "One of my favourite sessions at All Day Hey conference last month was Jack Franklin’s talk Abstractions, complexities and off-ramps. As web applications grow larger, they inevitably fall prey to complexity, despite our best intentions.",
                "url": "https://css-irl.info/reducing-complexity-in-front-end-development/",
                "date": "January 30, 2024 at 02:31PM"
            },
            {
                "title": "What happened with the Web Monetization API?",
                "excerpt": "I was pretty hot on it for a minute . I wanted it to succeed and thought it had the bones to make it. Coil was the main startup trying to push it. They did the…",
                "url": "https://chriscoyier.net/2024/01/24/what-happened-with-the-web-monetization-api/",
                "date": "January 31, 2024 at 08:46PM"
            },
            {
                "title": "Nicer Text Wrapping with CSS text-wrap",
                "excerpt": "Let’s take a look at the CSS text-wrap property and how we can use it to improve the way text flows on a web page. We can use text-wrap: balance to tell the…",
                "url": "https://codersblock.com/blog/nicer-text-wrapping-with-css-text-wrap/",
                "date": "January 31, 2024 at 08:58PM"
            },
            {
                "title": "No Analytics",
                "excerpt": "It was nice to see Rach talk about stripping out analytics . I stripped out my analytics years ago and while I thought I wrote about it, I can’t find where I…",
                "url": "https://snook.ca/archives/opinion/no-analytics",
                "date": "January 31, 2024 at 09:01PM"
            },
            {
                "title": "I turned off analytics",
                "excerpt": "I turned off the Plausible analytics for this site. I used to use analytics mostly to look for links back to my site from other creators. When I had so little…",
                "url": "https://rachsmith.com/i-turned-off-analytics/",
                "date": "January 31, 2024 at 09:03PM"
            }
        ]
    },
    {
        "month": "February",
        "links": [
            {
                "title": "The details element and in-page search - Manuel Matuzovic",
                "excerpt": "An important factor in terms of UX and accessibility for deciding whether the &lt;details&gt; element is…",
                "url": "https://www.matuzo.at/blog/2023/details-find-in-page",
                "date": "February 1, 2024 at 11:54PM"
            },
            {
                "title": "More than blogrolls",
                "excerpt": "The latest edition of Matthias Ott's Own Your Web (which I recommend subscribing too!) points out that there are a lot of blogs…",
                "url": "https://sebastiandedeyne.com/more-than-blogrolls/",
                "date": "February 1, 2024 at 11:54PM"
            },
            {
                "title": "The article element and screen readers - Manuel Matuzovic ",
                "excerpt": "I wanted to know how and if common screen readers expose the &lt;article&gt; element. Here are my results…",
                "url": "https://www.matuzo.at/blog/2023/article-screen-readers/",
                "date": "February 1, 2024 at 11:59PM"
            },
            {
                "title": "Ditch the developer Swiss Army Knife",
                "excerpt": "Our industry loves Swiss Army Knives. The tools we tend to gravitate towards are ones that do all the things . They’re packed with features. I get the appeal…",
                "url": "https://gomakethings.com/ditch-the-developer-swiss-army-knife/",
                "date": "February 2, 2024 at 11:49AM"
            },
            {
                "title": "Join the 11ty International Symposium on Making Web Sites Real Good",
                "excerpt": "Join the 11ty International Symposium on Making Web Sites Real Good (it’s an 11ty Conference) In May 2024…",
                "url": "https://www.zachleat.com/web/11tyconf/",
                "date": "February 2, 2024 at 11:50AM"
            },
            {
                "title": "3 questions to evaluate design patterns and avoid unnecessary work that degrades UX",
                "excerpt": "There’s a new form design trend going around: Buttons inside inputs. Anthony Hobday mentioned it by asking his audience if there was any…",
                "url": "https://adamsilver.io/blog/3-questions-to-evaluate-design-patterns-and-avoid-unnecessary-work-that-degrades-ux/",
                "date": "February 2, 2024 at 11:55AM"
            },
            {
                "title": "What’s The Perfect Design Process? — Smashing Magazine ",
                "excerpt": "What’s The Perfect Design Process? About The Author Vitaly Friedman loves beautiful content and doesn’t like to give in easily. When he is not…",
                "url": "https://www.smashingmagazine.com/2023/06/perfect-design-process/",
                "date": "February 4, 2024 at 06:26PM"
            },
            {
                "title": "4 Ways to Improve Mobile Accessibility - Karl Groves",
                "excerpt": "This is a repost of an old article on the Tenon blog. Since that’s being sunsetted, I’m reposting it below. Ensuring that your website is ADA compliant on…",
                "url": "https://karlgroves.com/4-ways-to-improve-mobile-accessibility/",
                "date": "February 4, 2024 at 08:35PM"
            },
            {
                "title": "CSS! CSS! CSS! - Manuel Matuzovic CSS! CSS! CSS!",
                "excerpt": "I just came home after three beautiful days in Amsterdam, where I gave a talk at the CSS Day conference. I’ve watched many…",
                "url": "https://www.matuzo.at/blog/2023/css-css-css",
                "date": "February 6, 2024 at 12:57PM"
            },
            {
                "title": "Inside .git",
                "excerpt": "I posted a comic on Mastodon this week about what’s in the .git directory and someone requested a text version, so here it is. I added someextra notes…",
                "url": "https://jvns.ca/blog/2024/01/26/inside-git/",
                "date": "February 6, 2024 at 01:39PM"
            },
            {
                "title": "RSS Feed Styles - David Bushell",
                "excerpt": "Now that I’m in my 15th year of blogging it’s past time I spruced up my RSS feed . I’ve also launched a new…",
                "url": "https://dbushell.com/2024/02/06/rss-feed-styles/",
                "date": "February 7, 2024 at 11:06PM"
            },
            {
                "title": "Thoughts on a Global Design System",
                "excerpt": "Dave and I just had Brad on ShopTalk Show to talk about his idea for a Global Design System . I love Brad’s optimism on all this. From Brad’s perspective, he’s…",
                "url": "https://chriscoyier.net/2024/02/05/thoughts-on-a-global-design-system/",
                "date": "February 7, 2024 at 11:16PM"
            },
            {
                "title": "Blockquotes in Screen Readers",
                "excerpt": "This post does not assert the correct way to code blockquotes, it will only demonstrate how screen readers announce some existing…",
                "url": "https://adrianroselli.com/2023/07/blockquotes-in-screen-readers.html",
                "date": "February 8, 2024 at 11:25PM"
            },
            {
                "title": "How to create rounded gradient borders with any background in CSS A solution!",
                "excerpt": "For many months I have been trying to find a decent solution to rounded gradient borders that allow a semi-transparent or blurred main background.",
                "url": "https://benfrain.com/how-to-create-rounded-gradient-borders-with-any-background-in-css/",
                "date": "February 8, 2024 at 11:29PM"
            },
            {
                "title": "The Indie Web and the joy of being weird",
                "excerpt": "GoMakeThings.com has been my home on the web for over 12 years. When I first started publishing here, I had an HR blog (I was an HR professional at the time)…",
                "url": "https://gomakethings.com/the-indie-web-and-the-joy-of-being-weird/",
                "date": "February 8, 2024 at 11:35PM"
            },
            {
                "title": "Pull request descriptions",
                "excerpt": "I used to leave pull request descriptions empty. \"Let the code speak for itself\" or \"let the commits speak for themselves\" are…",
                "url": "https://sebastiandedeyne.com/pull-request-descriptions",
                "date": "February 9, 2024 at 11:15PM"
            },
            {
                "title": "When to use CSS text-wrap: balance; vs text-wrap: pretty; - Stephanie Stimac",
                "excerpt": "When to use CSS text-wrap: balance; vs text-wrap: pretty; At the start of the year I had written about how I wanted to spend this year writing about new CSS…",
                "url": "https://blog.stephaniestimac.com/posts/2023/10/css-text-wrap/",
                "date": "February 9, 2024 at 11:24PM"
            },
            {
                "title": "Own Your Web – Issue 9: We ❤️ RSS",
                "excerpt": "In the last issue, we looked at blogrolls as one way to improve the visibility and discoverability of our sites. Whether or not you want to add a…",
                "url": "https://buttondown.email/ownyourweb/archive/issue-09/",
                "date": "February 13, 2024 at 09:37AM"
            },
            {
                "title": "Super Fast Builds by David Bushell",
                "excerpt": "I want to see more developers experiment with how they build their websites! Don’t just npm install a blackhole. Roll your own personal solution. It’s fun and…",
                "url": "https://dbushell.com/2024/02/14/super-fast-builds/",
                "date": "February 15, 2024 at 09:21AM"
            },
            {
                "title": "Eleventy Starter Project Updates",
                "excerpt": "This blog uses static site generator Eleventy (or 11ty. I have no idea which one is the “official” spelling, and the docs appear to delight in switching…",
                "url": "https://css-irl.info/eleventy-starter-projects-updates/",
                "date": "February 15, 2024 at 09:48AM"
            },
            {
                "title": "Let's create a Web Component from scratch!",
                "excerpt": "Because I love Web Components so much, today, I thought we’d build an HTML Web Component from scratch. Let’s build a component that shows and hides text when a…",
                "url": "https://gomakethings.com/lets-create-a-web-component-from-scratch/",
                "date": "February 16, 2024 at 07:33PM"
            },
            {
                "title": "New and Improved Green Web Hosting Directory from the Green Web Foundation",
                "excerpt": "The Green Web Foundation has recently redesigned their green web hosting directory. Previously the directory was a useful resource for finding hosting platforms…",
                "url": "https://css-irl.info/new-and-improved-green-web-hosting-directory/",
                "date": "February 16, 2024 at 07:44PM"
            },
            {
                "title": "Don’t Disable Form Controls",
                "excerpt": "Just another usability and accessibility pro telling authors not to do the thing they continue to do. It’s Ok to Disable Buttons There are…",
                "url": "https://adrianroselli.com/2024/02/dont-disable-form-controls.html",
                "date": "February 17, 2024 at 10:12PM"
            },
            {
                "title": "How to make external links accessible",
                "excerpt": "Links are what connect online content – they’re everywhere. Since they’re so common, their design and functionality often go unnoticed, especially when it comes…",
                "url": "https://blog.pope.tech/2024/01/02/how-to-make-external-links-accessible/",
                "date": "February 17, 2024 at 10:22PM"
            },
            {
                "title": "Animated SVG Logo",
                "excerpt": "I recently replaced the logo on the top left corner with an animated SVG: Inspiration The first time I saw such stroke animations in SVG is the Material Line…",
                "url": "https://antfu.me/posts/animated-svg-logo",
                "date": "February 18, 2024 at 09:58PM"
            }
        ]
    }
]
