[
  {
    "title": "Expanding Grid Cards with View Transitions",
    "content": "A friend showed me something of a design spec they were charged with pulling off: The requirements: &#8230; when I click on any of them it expands at the top to full width and the rest of the cards…",
    "url": "https://chriscoyier.net/2023/04/11/expanding-grid-cards-with-view-transitions/",
    "date": "2024-01-06T00:00:00.000Z"
  },
  {
    "title": "CSS Custom Properties Beyond the :root",
    "content": "Is there a good reason why we’re defining global custom properties on :root/html and not on body?",
    "url": "https://matthiasott.com/notes/custom-properties-beyond-the-root",
    "date": "2024-01-06T00:00:00.000Z"
  },
  {
    "title": "A few developer console tricks",
    "content": "In my new free course for beginners, Learn JavaScript, I talk briefly about how powerful the developer console is, and why I think it&rsquo;s ones of the best features of working in the front end.",
    "url": "https://gomakethings.com/a-few-developer-console-tricks/",
    "date": "2024-01-06T00:00:00.000Z"
  },
  {
    "title": "Is It Time To Replace Sass?",
    "content": "With the growth of native CSS features - including nesting - what features do we still gain by using Sass, and what is available to use in its place?",
    "url": "https://thinkdobecreate.com/articles/is-it-time-to-replace-sass/",
    "date": "2024-01-08T00:00:00.000Z"
  },
  {
    "title": "Batching Life Changes",
    "content": "I’ve never really done a “year in review” post before, but 2023 and, in particular, the last few months, have brought tides of change that I feel the need to share",
    "url": "https://chrisburnell.com/article/batching-life-changes/",
    "date": "2024-01-08T00:00:00.000Z"
  },
  {
    "title": "How Do You Vertically Centre an Element in CSS? (Even More) Easily!",
    "content": "Rachel Andrew shared a snippet of good news for CSS layout on her blog the other day: it’ll soon be possible to vertically centre an element inside a parent without the parent needing to be a flex or grid container, using the align-content property.",
    "url": "https://css-irl.info/how-do-you-vertically-centre-an-element-in-css/",
    "date": "2024-01-12T00:00:00.000Z"
  },
  {
    "title": "A CSS native way to prevent orphan text",
    "content": "In typography, an orphan or widow is a single word on its own line. It can look particularly unpleasing with headings, and is hard to &ldquo;plan for&rdquo; on the web, where people view your site on a wide range of viewport sizes. You can avoid them by manually added a non-breaking space (&amp;nbsp;) before the second and last word in every sentence, but doing that manually is madness. &lt;h2&gt;How to use the Array.",
    "url": "https://gomakethings.com/a-css-native-way-to-prevent-orphan-text/",
    "date": "2024-01-12T00:00:00.000Z"
  },
  {
    "title": "Giving context to a blogroll",
    "content": "Garrit Franke’s recent post, titled “Roast my site”, motivated me to write about something that has always bugged me with personal sites: the grocery-style blogroll",
    "url": "https://minutestomidnight.co.uk/blog/giving-context-to-a-blogroll/",
    "date": "2024-01-12T00:00:00.000Z"
  },
  {
    "title": "Local link targets must be focusable to prevent accessibility issues",
    "content": "If you&#x27;re linking to local elements via id you must ensure that they are focusable because otherwise assistive technology relying on &#x22;document.activeElement&#x22; can&#x27;t follow the link target.",
    "url": "https://www.stefanjudis.com/today-i-learned/relative-html-links-focus-issues/",
    "date": "2024-01-13T00:00:00.000Z"
  },
  {
    "title": "Exposed RSS",
    "content": "I get sites not having an &#8220;RSS&#8221; for &#8220;Feed&#8221; link on their website while actually having an RSS feed. I don&#8217;t like it, but I get it. Maybe they picked an off-the-shelf t…",
    "url": "https://chriscoyier.net/2024/01/13/exposed-rss/",
    "date": "2024-01-14T00:00:00.000Z"
  },
  {
    "title": "Using abbr Element with title Attribute",
    "content": "How the &lt;abbr&gt; element is defined and exposed, along with the title attribute: § 4.5.9 The abbr element from WHATWG. ARIA in HTML entry on &lt;abbr&gt; notes it has no implicit role and naming is prohibited. Which is probably why Core Accessibility API Mappings 1.2 does not list it. HTML&hellip;",
    "url": "https://adrianroselli.com/2024/01/using-abbr-element-with-title-attribute.html",
    "date": "2024-01-15T00:00:00.000Z"
  },
  {
    "title": "Sharing links",
    "content": "The amount of content on the web is so large, that it's tricky to find the stuff worth reading. One of my strategies is to follow people I trust and read what they share.",
    "url": "https://hidde.blog/sharing-links/",
    "date": "2024-01-15T00:00:00.000Z"
  },
  {
    "title": "The gotchas of CSS Nesting",
    "content": "I've written before about the problems you can run into with CSS nesting and the question that @ChallengeCSS tweeted out today made me realize there's actually a few more gotcha's.",
    "url": "https://kilianvalkhof.com/2023/css-html/the-gotchas-of-css-nesting/",
    "date": "2024-01-16T00:00:00.000Z"
  },
  {
    "title": "Testing My Eleventy-Website With Cypress and Netlify",
    "content": "Last time I wrote &quot;this page is a repository consisting of some thrown-together and latenight-written code&quot;. Some tests should ensure that I don&#39;t break to much when I&#39;m, cleaning up the code. Here&#39;s how I created a basic setup that runs my tests before every deployment.",
    "url": "https://martinschneider.me/articles/testing-my-eleventy-website-with-cypress-and-netlify/",
    "date": "2024-01-17T00:00:00.000Z"
  },
  {
    "title": "Fetching Webmentions With Netlify and Eleventy Edge",
    "content": "Sadly, I&#39;m not too good at documenting what I&#39;m sometimes building in the little free time that I have. At the end of last year, I implemented an interesting feature on this site, but never wrote about it.",
    "url": "https://martinschneider.me/articles/fetching-webmentions-with-netlify-and-eleventy-edge/",
    "date": "2024-01-17T00:00:00.000Z"
  },
  {
    "title": "Creating Scroll-Triggered Animations by combining Scroll-Driven Animations, Custom Properties, Style Queries, and Transitions",
    "content": "When you combine Scroll-Driven Animations with Custom Properties, Style Queries, and Transitions you hack your way into creating Scroll-Triggered Animations.",
    "url": "https://www.bram.us/2023/06/15/scroll-triggered-animations/",
    "date": "2024-01-17T00:00:00.000Z"
  },
  {
    "title": "6 Quick tests you can do to test your forms for accessibility",
    "content": "Whenever I do a full audit for a website, I have almost 40 individual, highly granular, form-related checks. Those checks can be boiled down to the following 6 high level goals.",
    "url": "https://karlgroves.com/6-quick-tests-you-can-do-to-test-your-forms-for-accessibility/",
    "date": "2024-01-17T00:00:00.000Z"
  },
  {
    "title": "Time to First Byte: What it is and How to Make Improvements",
    "content": "TTFB is the backbone of page speed: it can make or break the experience of your sites. Learn how to test and  track it.",
    "url": "https://calibreapp.com/blog/time-to-first-byte",
    "date": "2024-01-19T00:00:00.000Z"
  },
  {
    "title": "Bulletproofing your CMS",
    "content": "Help your future self by making sure your CMS can take anything clients throw at it.",
    "url": "https://www.nicchan.me/blog/bulletproofing-your-cms/",
    "date": "2024-01-22T00:00:00.000Z"
  },
  {
    "title": "12 Modern CSS One-Line Upgrades - Modern CSS Solutions",
    "content": "Sometimes, improving your application CSS just takes a one-line upgrade or enhancement! Learn about 12 properties to start incorporating into your projects, and enjoy reducing technical debt, removing JavaScript, and scoring easy wins for user experience.",
    "url": "https://moderncss.dev/12-modern-css-one-line-upgrades/",
    "date": "2024-01-22T00:00:00.000Z"
  },
  {
    "title": "Better form UX with the CSS property `field-sizing`",
    "content": "A look at the `field-sizing` CSS property and how it could improve web form user experience.",
    "url": "https://blog.stephaniestimac.com/posts/2024/01/css-field-sizing/",
    "date": "2024-01-23T00:00:00.000Z"
  },
  {
    "title": "Progressively enhancing a link into a button with vanilla JavaScript",
    "content": "In yesterday&rsquo;s article on loading HTML from another page, I talked about progressively enhancing a link into a button. Let’s imagine you have a dialog modal that loads some HTML. You might keep all that HTML in a separate file, and by default display a link to it. &lt;a href=&#34;/terms&#34;&gt;Read the Terms of Service&lt;/a&gt;  When your JS loads, you can progressively enhance it into a modal toggle.",
    "url": "https://gomakethings.com/progressively-enhancing-a-link-into-a-button-with-vanilla-javascript/",
    "date": "2024-01-23T00:00:00.000Z"
  },
  {
    "title": "5 key design system elements to build trust and maximise uptake",
    "content": "Since 2016 I’ve used, created and contributed to multiple design systems. I’ve seen what works and what doesn’t. By “doesn’t” I mean designers don’t trust it. And as a result they don’t use it",
    "url": "https://adamsilver.io/blog/5-key-design-system-elements-to-build-trust-and-maximise-uptake/",
    "date": "2024-01-24T00:00:00.000Z"
  },
  {
    "title": "A quick introduction to CSS @scope",
    "content": "An introductory thread to CSS @scope.",
    "url": "https://www.bram.us/2023/08/22/a-quick-introduction-to-css-scope",
    "date": "2024-01-24T00:00:00.000Z"
  },
  {
    "title": "Positioning anchored popovers",
    "content": "Popovers are in the top layer, how can we position them relative to invokers that are not?",
    "url": "https://hidde.blog/positioning-anchored-popovers/",
    "date": "2024-01-30T00:00:00.000Z"
  },
  {
    "title": "Reducing Complexity in Front End Development",
    "content": "One of my favourite sessions at All Day Hey conference last month was Jack Franklin’s talk Abstractions, complexities and off-ramps. As web applications grow larger, they inevitably fall prey to complexity, despite our best intentions.",
    "url": "https://css-irl.info/reducing-complexity-in-front-end-development/",
    "date": "2024-01-30T00:00:00.000Z"
  },
  {
    "title": "What happened with the Web Monetization API?",
    "content": "I was pretty hot on it for a minute . I wanted it to succeed and thought it had the bones to make it. Coil was the main startup trying to push it. They did the…",
    "url": "https://chriscoyier.net/2024/01/24/what-happened-with-the-web-monetization-api/",
    "date": "2024-01-31T00:00:00.000Z"
  },
  {
    "title": "Nicer Text Wrapping with CSS text-wrap",
    "content": "Let’s take a look at the CSS text-wrap property and how we can use it to improve the way text flows on a web page. We can use text-wrap: balance to tell the…",
    "url": "https://codersblock.com/blog/nicer-text-wrapping-with-css-text-wrap/",
    "date": "2024-01-31T00:00:00.000Z"
  },
  {
    "title": "No Analytics",
    "content": "It was nice to see Rach talk about stripping out analytics . I stripped out my analytics years ago and while I thought I wrote about it, I can’t find where I…",
    "url": "https://snook.ca/archives/opinion/no-analytics",
    "date": "2024-01-31T00:00:00.000Z"
  },
  {
    "title": "I turned off analytics",
    "content": "I turned off the Plausible analytics for this site. I used to use analytics mostly to look for links back to my site from other creators. When I had so little…",
    "url": "https://rachsmith.com/i-turned-off-analytics/",
    "date": "2024-01-31T00:00:00.000Z"
  },
  {
    "title": "The details element and in-page search - Manuel Matuzovic",
    "content": "An important factor in terms of UX and accessibility for deciding whether the &lt;details&gt; element is…",
    "url": "https://www.matuzo.at/blog/2023/details-find-in-page",
    "date": "2024-02-01T00:00:00.000Z"
  },
  {
    "title": "More than blogrolls",
    "content": "The latest edition of Matthias Ott's Own Your Web (which I recommend subscribing too!) points out that there are a lot of blogs…",
    "url": "https://sebastiandedeyne.com/more-than-blogrolls/",
    "date": "2024-02-01T00:00:00.000Z"
  },
  {
    "title": "The article element and screen readers",
    "content": "I wanted to know how and if common screen readers expose the &lt;article&gt; element. Here are my results…",
    "url": "https://www.matuzo.at/blog/2023/article-screen-readers/",
    "date": "2024-02-01T00:00:00.000Z"
  },
  {
    "title": "Ditch the developer Swiss Army Knife",
    "content": "Our industry loves Swiss Army Knives. The tools we tend to gravitate towards are ones that do all the things . They’re packed with features. I get the appeal…",
    "url": "https://gomakethings.com/ditch-the-developer-swiss-army-knife/",
    "date": "2024-02-02T00:00:00.000Z"
  },
  {
    "title": "Join the 11ty International Symposium on Making Web Sites Real Good",
    "content": "Join the 11ty International Symposium on Making Web Sites Real Good (it’s an 11ty Conference) In May 2024…",
    "url": "https://www.zachleat.com/web/11tyconf/",
    "date": "2024-02-02T00:00:00.000Z"
  },
  {
    "title": "3 questions to evaluate design patterns and avoid unnecessary work that degrades UX",
    "content": "There’s a new form design trend going around: Buttons inside inputs. Anthony Hobday mentioned it by asking his audience if there was any…",
    "url": "https://adamsilver.io/blog/3-questions-to-evaluate-design-patterns-and-avoid-unnecessary-work-that-degrades-ux/",
    "date": "2024-02-02T00:00:00.000Z"
  },
  {
    "title": "What’s The Perfect Design Process?",
    "content": "The design process is messy. You might be following a structured approach, but too often, it takes a life of its own. And before you know it, you are designing in chaos, with…",
    "url": "https://www.smashingmagazine.com/2023/06/perfect-design-process/",
    "date": "2024-02-04T00:00:00.000Z"
  },
  {
    "title": "4 Ways to Improve Mobile Accessibility",
    "content": "This is a repost of an old article on the Tenon blog. Since that’s being sunsetted, I’m reposting it below. Ensuring that your website is ADA compliant on…",
    "url": "https://karlgroves.com/4-ways-to-improve-mobile-accessibility/",
    "date": "2024-02-04T00:00:00.000Z"
  },
  {
    "title": "CSS! CSS! CSS!",
    "content": "I just came home after three beautiful days in Amsterdam, where I gave a talk at the CSS Day conference. I’ve watched many…",
    "url": "https://www.matuzo.at/blog/2023/css-css-css",
    "date": "2024-02-06T00:00:00.000Z"
  },
  {
    "title": "Inside .git",
    "content": "I posted a comic on Mastodon this week about what’s in the .git directory and someone requested a text version, so here it is. I added someextra notes…",
    "url": "https://jvns.ca/blog/2024/01/26/inside-git/",
    "date": "2024-02-06T00:00:00.000Z"
  },
  {
    "title": "RSS Feed Styles",
    "content": "Now that I’m in my 15th year of blogging it’s past time I spruced up my RSS feed . I’ve also launched a new…",
    "url": "https://dbushell.com/2024/02/06/rss-feed-styles/",
    "date": "2024-02-07T00:00:00.000Z"
  },
  {
    "title": "Thoughts on a Global Design System",
    "content": "Dave and I just had Brad on ShopTalk Show to talk about his idea for a Global Design System . I love Brad’s optimism on all this. From Brad’s perspective, he’s…",
    "url": "https://chriscoyier.net/2024/02/05/thoughts-on-a-global-design-system/",
    "date": "2024-02-07T00:00:00.000Z"
  },
  {
    "title": "Blockquotes in Screen Readers",
    "content": "This post does not assert the correct way to code blockquotes, it will only demonstrate how screen readers announce some existing…",
    "url": "https://adrianroselli.com/2023/07/blockquotes-in-screen-readers.html",
    "date": "2024-02-08T00:00:00.000Z"
  },
  {
    "title": "How to create rounded gradient borders with any background in CSS A solution!",
    "content": "For many months I have been trying to find a decent solution to rounded gradient borders that allow a semi-transparent or blurred main background.",
    "url": "https://benfrain.com/how-to-create-rounded-gradient-borders-with-any-background-in-css/",
    "date": "2024-02-08T00:00:00.000Z"
  },
  {
    "title": "The Indie Web and the joy of being weird",
    "content": "GoMakeThings.com has been my home on the web for over 12 years. When I first started publishing here, I had an HR blog (I was an HR professional at the time)…",
    "url": "https://gomakethings.com/the-indie-web-and-the-joy-of-being-weird/",
    "date": "2024-02-08T00:00:00.000Z"
  },
  {
    "title": "Pull request descriptions",
    "content": "I used to leave pull request descriptions empty. \"Let the code speak for itself\" or \"let the commits speak for themselves\" are…",
    "url": "https://sebastiandedeyne.com/pull-request-descriptions",
    "date": "2024-02-09T00:00:00.000Z"
  },
  {
    "title": "When to use CSS text-wrap: balance; vs text-wrap: pretty",
    "content": "When to use CSS text-wrap: balance; vs text-wrap: pretty; At the start of the year I had written about how I wanted to spend this year writing about new CSS…",
    "url": "https://blog.stephaniestimac.com/posts/2023/10/css-text-wrap/",
    "date": "2024-02-09T00:00:00.000Z"
  },
  {
    "title": "Own Your Web – Issue 9: We ❤️ RSS",
    "content": "In the last issue, we looked at blogrolls as one way to improve the visibility and discoverability of our sites. Whether or not you want to add a…",
    "url": "https://buttondown.email/ownyourweb/archive/issue-09/",
    "date": "2024-02-13T00:00:00.000Z"
  },
  {
    "title": "Super Fast Builds",
    "content": "I want to see more developers experiment with how they build their websites! Don’t just npm install a blackhole. Roll your own personal solution. It’s fun and…",
    "url": "https://dbushell.com/2024/02/14/super-fast-builds/",
    "date": "2024-02-15T00:00:00.000Z"
  },
  {
    "title": "Eleventy Starter Project Updates",
    "content": "This blog uses static site generator Eleventy (or 11ty. I have no idea which one is the “official” spelling, and the docs appear to delight in switching…",
    "url": "https://css-irl.info/eleventy-starter-projects-updates/",
    "date": "2024-02-15T00:00:00.000Z"
  },
  {
    "title": "Let's create a Web Component from scratch!",
    "content": "Because I love Web Components so much, today, I thought we’d build an HTML Web Component from scratch. Let’s build a component that shows and hides text when a…",
    "url": "https://gomakethings.com/lets-create-a-web-component-from-scratch/",
    "date": "2024-02-16T00:00:00.000Z"
  },
  {
    "title": "New and Improved Green Web Hosting Directory from the Green Web Foundation",
    "content": "The Green Web Foundation has recently redesigned their green web hosting directory. Previously the directory was a useful resource for finding hosting platforms…",
    "url": "https://css-irl.info/new-and-improved-green-web-hosting-directory/",
    "date": "2024-02-16T00:00:00.000Z"
  },
  {
    "title": "Don’t Disable Form Controls",
    "content": "Just another usability and accessibility pro telling authors not to do the thing they continue to do. It’s Ok to Disable Buttons There are…",
    "url": "https://adrianroselli.com/2024/02/dont-disable-form-controls.html",
    "date": "2024-02-17T00:00:00.000Z"
  },
  {
    "title": "How to make external links accessible",
    "content": "Links are what connect online content – they’re everywhere. Since they’re so common, their design and functionality often go unnoticed, especially when it comes…",
    "url": "https://blog.pope.tech/2024/01/02/how-to-make-external-links-accessible/",
    "date": "2024-02-17T00:00:00.000Z"
  },
  {
    "title": "Animated SVG Logo",
    "content": "I recently replaced the logo on the top left corner with an animated SVG: Inspiration The first time I saw such stroke animations in SVG is the Material Line…",
    "url": "https://antfu.me/posts/animated-svg-logo",
    "date": "2024-02-18T00:00:00.000Z"
  },
  {
    "title": "Static Site Generators and CMS's",
    "content": "I write a lot about my love of Static Site Generators. They’re fast. Easier to theme. Easier to maintain. Less prone to vulnerabilities. More portable. But they…",
    "url": "https://gomakethings.com/static-site-generators-and-cmss/",
    "date": "2024-02-19T00:00:00.000Z"
  },
  {
    "title": "mastodon-post Web Component",
    "content": "The mastodon-post Web Component allows you to turn a regular link to a Mastodon post into an embeddable post quote including metadata such as reply count, boost…",
    "url": "https://darn.es/mastodon-post-web-component/",
    "date": "2024-02-19T00:00:00.000Z"
  },
  {
    "title": "Read later",
    "content": "My latest post generated a few emails from people suggesting alternatives to my semi-manual Instapaper solution. The back-and-forth convinced me to…",
    "url": "https://minutestomidnight.co.uk/blog/read-later/",
    "date": "2024-02-20T00:00:00.000Z"
  },
  {
    "title": "Why Markdown is a great design tool",
    "content": "Markdown is an incredibly flexible tool that’s part of my daily working practice. Almost everything I write digitally (including this post) starts in Markdown…",
    "url": "https://www.benjystanton.co.uk/blog/why-markdown-is-a-great-design-tool/",
    "date": "2024-02-20T00:00:00.000Z"
  },
  {
    "title": "Decision time",
    "content": " I’ve always associated good design with thoughtfulness. Like, I should be able to point to any element in an interface and the designer should be able to tell…",
    "url": "https://adactio.com/journal/20564",
    "date": "2024-02-20T00:00:00.000Z"
  },
  {
    "title": "Tailwind is bad",
    "content": "Yes, this is a clickbait title, but it’s also (mostly) true. If you’re not familiar with Tailwind (bless your heart), it’s a “utility-first CSS framework.” I’ve…",
    "url": "https://gomakethings.com/tailwind-is-bad/",
    "date": "2024-02-23T00:00:00.000Z"
  },
  {
    "title": "Automatic Mastodon post embeds",
    "content": "I use Nicolas Hoizey's GitHub action to syndicate my web activity to Mastodon. Recently, I removed the display of webmentions from my posts after seeing Chris…",
    "url": "https://coryd.dev/posts/2024/automatic-mastodon-post-embeds/",
    "date": "2024-02-23T00:00:00.000Z"
  },
  {
    "title": "Cut the Intro",
    "content": "Here’s one way to improve the thing you’re writing: cut the intro. Writing about the symbiosis between trees and mushrooms? Don’t start talking about how…",
    "url": "https://robinrendle.com/notes/cut-the-intro/",
    "date": "2024-02-24T00:00:00.000Z"
  },
  {
    "title": "Don't disable buttons",
    "content": "One of the most common accessibility issues I find (and fix) on client projects is dynamically disabled form buttons when a form is being submitted. Today I…",
    "url": "https://gomakethings.com/dont-disable-buttons/",
    "date": "2024-02-24T00:00:00.000Z"
  },
  {
    "title": "More Things You Can Do on Your Website",
    "content": "James wrote a great post with 100 83 ideas for things to do on a website [1] with a call for people suggest more so here's another… ",
    "url": "https://rknight.me/blog/more-things-you-can-do-on-your-website/",
    "date": "2024-02-25T00:00:00.000Z"
  },
  {
    "title": "100 things you can do on your personal website",
    "content": "One of my favourite things to do in my free time is to tinker with this website. Indeed, this website is the culmination of years of tinkering. I have added…",
    "url": "https://jamesg.blog/2024/02/19/personal-website-ideas/",
    "date": "2024-02-25T00:00:00.000Z"
  },
  {
    "title": "Own Your Web – Issue 10: Links Worth Sharing",
    "content": "Hi All! 🤗 Every day, we browse the Web and scroll our timelines. And every day, we find even more interesting websites, blog posts, articles, videos, podcasts…",
    "url": "https://buttondown.email/ownyourweb/archive/issue-10/",
    "date": "2024-02-27T00:00:00.000Z"
  },
  {
    "title": "Piccalilli Links",
    "content": "You might have noticed that I’m starting to share links on here. There’s a hole that’s been left by publications like CSS-Tricks and A List Apart going quiet…",
    "url": "https://piccalil.li/blog/piccalilli-links/",
    "date": "2024-02-27T00:00:00.000Z"
  },
  {
    "title": "Where I’m at on the whole CSS-Tricks thing",
    "content": "It was March 2022 when I sold CSS-Tricks to DigitalOcean. So it’s been just about 2 years now. This was me and my wife’s thinking: The negotiated sale price was…",
    "url": "https://chriscoyier.net/2024/02/28/where-im-at-on-the-whole-css-tricks-thing/",
    "date": "2024-02-28T00:00:00.000Z"
  },
  {
    "title": "Now's the time to own and host your own content",
    "content": "We've seen Meta, Google, Microsoft, Apple, Reddit, Automattic, Mozilla — name a company — integrate AI that continues to be trained on public data with or…",
    "url": "https://coryd.dev/posts/2024/nows-the-time-to-own-and-host-your-own-content/",
    "date": "2024-02-28T00:00:00.000Z"
  },
  {
    "title": "Tailwind vs. Semantic CSS",
    "content": "Over the last week or two, I’ve written about why Tailwind is bad. Yesterday, I stumbled upon this article from Tero Piirainen comparing semantic CSS to…",
    "url": "https://gomakethings.com/tailwind-vs.-semantic-css/",
    "date": "2024-02-29T00:00:00.000Z"
  },
  {
    "title": "How to create a responsive grid system with CSS Grid",
    "content": "I recently updated the grid system on my site from Flexbox to CSS Grid. Today, I wanted to share how to use it, how it works under-the-hood, and why I made the…",
    "url": "https://gomakethings.com/how-to-create-a-responsive-grid-system-with-css-grid/",
    "date": "2024-03-01T00:00:00.000Z"
  },
  {
    "title": "Capo.js: A five minute web performance boost",
    "content": "You want a quick web performance win at work that’s sure to get you a promotion? Want it to only take five minutes? Then I got you. Capo.js is a tool to get…",
    "url": "https://frontendmasters.com/blog/capo-js-a-five-minute-web-performance-boost/",
    "date": "2024-03-01T00:00:00.000Z"
  },
  {
    "title": "The path to becoming a publisher - Piccalilli",
    "content": "In my 2023 wrap-up post I said the following: I also see a gap in publications. CSS-Tricks is done now, and unfortunately, been abandoned. A List Apart has…",
    "url": "https://piccalil.li/blog/the-path-to-becoming-a-publisher/",
    "date": "2024-03-02T00:00:00.000Z"
  },
  {
    "title": "AI and accessible front-end components: is the nuance generatable?",
    "content": "Companies are rushing to add generated AI capabilities to their products. Some promise to produce front-end components for you. Is that even possible, given the…",
    "url": "https://hidde.blog/ai-for-accessible-components/",
    "date": "2024-03-02T00:00:00.000Z"
  },
  {
    "title": "Which CSS framework should I use?",
    "content": "I’ve been ragging on Tailwind a lot lately (because it’s terrible). One of the natural follow-up questions I get is… Which CSS framework do you like? I tend to…",
    "url": "https://gomakethings.com/which-css-framework-should-i-use/",
    "date": "2024-03-02T00:00:00.000Z"
  },
  {
    "title": "Deploy an Eleventy site to Cloudflare Pages efficiently with GitHub's action cache",
    "content": "I have wanted to move this site from Netlify for a while now, but the recent news about their bandwidth pricing made me finally do it. I looked into some…",
    "url": "https://jonas.brusman.se/deploy-eleventy-to-cloudflare-with-githubs-action-cache/",
    "date": "2024-03-03T00:00:00.000Z"
  },
  {
    "title": "Automated weekly links posts with raindrop.io and Eleventy",
    "content": "A post that's been getting a lot of traction recently is I miss human curation by Cassidy Williams, in which she laments that we're so reliant on algorithms…",
    "url": "https://localghost.dev/blog/automated-weekly-links-posts-with-raindrop-io-and-eleventy/",
    "date": "2024-03-03T00:00:00.000Z"
  },
  {
    "title": "Sliders degrade UX (so do this instead)",
    "content": "18 February 2024 My friend Victor shared this design tip on Twitter last week: He said that if you put the slider values on top, your finger won’t cover them…",
    "url": "https://adamsilver.io/blog/sliders-degrade-ux-so-do-this-instead/",
    "date": "2024-03-04T00:00:00.000Z"
  },
  {
    "title": "Simplify sharing with built-in APIs and progressive enhancement",
    "content": "You’ve written a great post or produced a delightful website and now you want people to share it. In times gone by, you might be tempted to add a section like…",
    "url": "https://set.studio/simplify-sharing-with-built-in-apis-and-progressive-enhancement/",
    "date": "2024-03-04T00:00:00.000Z"
  },
  {
    "title": "Progressively Enhanced HTML Accordion",
    "content": "Does what it says on the tin. Uses <details> and <summary> with a bit of ARIA to create an accordion that works without JavaScript while…",
    "url": "https://adrianroselli.com/2023/08/progressively-enhanced-html-accordion.html",
    "date": "2024-03-06T00:00:00.000Z"
  },
  {
    "title": "Adding Search to an Eleventy Site Without Client-side JavaScript",
    "content": "Adding Search to an Eleventy Site Without Client-side JavaScript October 9th, 2023 Earlier this year (2023) I added a search feature to my blog. I’ve always…",
    "url": "https://www.philiprenich.com/blog/adding-search-to-an-eleventy-site-without-client-side-javascript/",
    "date": "2024-03-06T00:00:00.000Z"
  },
  {
    "title": "How layout position impacts three big web performance levers",
    "content": "We help Shopify merchants improve their web performance and see three common problems related to layout position: Lazy loading images above the fold…",
    "url": "https://performance.shopify.com/blogs/blog/how-layout-position-impacts-three-big-web-performance-levers",
    "date": "2024-03-09T00:00:00.000Z"
  },
  {
    "title": "Some little ways I’m using CSS :has() in the real world",
    "content": "There’s a lot of chatter around the new(ish) :has() pseudo-class. It’s something we’ve been crying out for, for years: being able to select parent elements! A…",
    "url": "https://piccalil.li/blog/some-little-ways-im-using-css-has-in-the-real-world/",
    "date": "2024-03-09T00:00:00.000Z"
  },
  {
    "title": "Don’t use paracetamol to fix bad UX",
    "content": "My dad was a pharmacist. Whenever I was ill, he’d tell me to take paracetamol. So I did. And it made me feel better. But paracetamol doesn’t…",
    "url": "https://adamsilver.io/blog/dont-use-paracetamol-to-fix-bad-ux/",
    "date": "2024-03-11T00:00:00.000Z"
  },
  {
    "title": "Using an Eleventy event to optimize component JavaScript",
    "content": "My site leverages a number of web component for functionality on my site. Namely: mastodon post embeds, search, my now playing component, my theme toggle, post…",
    "url": "https://coryd.dev/posts/2024/using-an-eleventy-event-to-optimize-component-javascript/",
    "date": "2024-03-11T00:00:00.000Z"
  },
  {
    "title": "Sharing links via RSS, sharing links via APIs",
    "content": "I follow and subscribe to a whole bunch of blogs and less and less high-volume news via RSS. It's one of my absolute favorite mediums for keeping up with and…",
    "url": "https://coryd.dev/posts/2024/sharing-links-via-rss-sharing-links-via-apis/",
    "date": "2024-03-11T00:00:00.000Z"
  },
  {
    "title": "Own Your Web – Issue 11: Welcome to the IndieWeb",
    "content": "Hi All! 🤗 Imagine you post and make new friends on an online network for more than a decade – and suddenly, your account gets suspended for no apparent reason…",
    "url": "https://buttondown.email/ownyourweb/archive/issue-11/",
    "date": "2024-03-12T00:00:00.000Z"
  },
  {
    "title": "Following Links",
    "content": "I loved this post from Chris Enns (via Robb Knight) where he outlines the rabbit hole of links he ventured down in writing that post. It felt fun and familiar…",
    "url": "https://blog.jim-nielsen.com/2024/following-links/",
    "date": "2024-03-12T00:00:00.000Z"
  },
  {
    "title": "CSS Button Styles You Might Not Know",
    "content": "CSS Button Styles You Might Not Know Sunday 10 Mar 2024 Buttons are everywhere! We can use all sorts of fancy CSS to style a button. I prefer using Flexbox…",
    "url": "https://dbushell.com/2024/03/10/css-button-styles-you-might-not-know/",
    "date": "2024-03-12T00:00:00.000Z"
  },
  {
    "title": "Surfacing most used tags in Eleventy",
    "content": "I made some lightweight design changes to my site, keeping things simple but moving the date up above post headers, surfacing tags below and restoring Read more…",
    "url": "https://coryd.dev/posts/2024/surfacing-most-used-tags-in-eleventy/",
    "date": "2024-03-13T00:00:00.000Z"
  },
  {
    "title": "Leaving Netlify",
    "content": "Leaving Netlify Tomorrow marks the first week after migrating all the websites I share with my wife Silvia, from Netlify to Mythic Beasts. Very happy about the…",
    "url": "https://minutestomidnight.co.uk/blog/leaving-netlify/",
    "date": "2024-03-13T00:00:00.000Z"
  },
  {
    "title": "You don't have to be a “content creator” to have a website.",
    "content": "This is clearly the result of living in a capitalist society. In recent years, people have felt the pressure to monetise their hobbies, so there’s a constant…",
    "url": "https://ohhelloana.blog/just-get-a-website/",
    "date": "2024-03-14T00:00:00.000Z"
  },
  {
    "title": "Fetching Package Dependents from GitHub",
    "content": "A conversation in the Eleventy Discord led me to remember about the dependents page of a GitHub repository. That is, a list of…",
    "url": "https://rknight.me/blog/fetching-package-dependents-from-github/",
    "date": "2024-03-14T00:00:00.000Z"
  },
  {
    "title": "11ty Linkrolls",
    "content": "Gotta get yourself connected... One of the things I've always loved about blogs were the linkrolls... that candy trail to more and more interesting things…",
    "url": "https://another.rodeo/linkroll/",
    "date": "2024-03-14T00:00:00.000Z"
  },
  {
    "title": "How I Eleventy",
    "content": "I first starting using Eleventy to build this site back in 2020 using version 0.10.0 and through a combination of the official documentation and other people's…",
    "url": "https://declanbyrd.co.uk/journal/2024/how-i-eleventy/",
    "date": "2024-03-16T00:00:00.000Z"
  },
  {
    "title": "You Want border-color: transparent, Not border: none",
    "content": "If you find yourself removing a border from an element that has a border and are tempted to use border: 0 , border: none, or outline: none, I’d urge you to stop…",
    "url": "https://frontendmasters.com/blog/you-want-border-color-transparent-not-border-none/",
    "date": "2024-03-16T00:00:00.000Z"
  },
  {
    "title": "We Need to Talk About Your Eleventy Post Dates",
    "content": "Since I really got back into following RSS feeds in the past couple of years I've noticed a problem with Eleventy sites[1] and post…",
    "url": "https://rknight.me/blog/eleventy-post-dates/",
    "date": "2024-03-17T00:00:00.000Z"
  },
  {
    "title": "Welcome to the IndieWeb",
    "content": "Imagine you post and make new friends on an online network for more than a decade – and suddenly, your account gets suspended for no apparent reason. And there…",
    "url": "https://matthiasott.com/notes/welcome-to-the-indieweb",
    "date": "2024-03-17T00:00:00.000Z"
  },
  {
    "title": "The 'IndieWeb' feels like coming home",
    "content": "The 'IndieWeb' feels like coming home tech personal Eleventy IndieWeb featured Due to the convenience of not needing to code or maintain anything…",
    "url": "https://daught.me/blog/2024/indie-web/",
    "date": "2024-03-17T00:00:00.000Z"
  },
  {
    "title": "Time to Ditch Analytics? Tracking Scripts and Web Sustainability",
    "content": "This article on privacy-focussed web design by Paul Jardine and Becky Thorn of sustainably-minded web design agency Root raises some great points about the link…",
    "url": "https://css-irl.info/time-to-ditch-analytics/",
    "date": "2024-03-19T00:00:00.000Z"
  },
  {
    "title": "Lightweight search in Eleventy",
    "content": "I've been using Pagefind for my site search for a while now and would readily recommend it, but I wanted to throw together something a bit lighter weight and…",
    "url": "https://coryd.dev/posts/2024/lightweight-search-in-eleventy/",
    "date": "2024-03-19T00:00:00.000Z"
  },
  {
    "title": "Readable code tips: Introduction",
    "content": "There’s lots about code that slows us down I’ve been doing a lot of code reviews recently. And while most of the code I review works (by which I mean: meets the…",
    "url": "https://rosswintle.uk/2024/03/readable-code-tips-intro/",
    "date": "2024-03-21T00:00:00.000Z"
  },
  {
    "title": "Better type layouts with CSS",
    "content": "I wanted to quickly share two newer CSS properties that make it easier to create nice, well-balanced layouts. The text-wrap property has two newish…",
    "url": "https://gomakethings.com/better-type-layouts-with-css/",
    "date": "2024-03-21T00:00:00.000Z"
  },
  {
    "title": "When to Nest CSS",
    "content": "With the recent news that CSS nesting is now available in the major evergreen browsers , our team was discussing how it differs from nesting in Sass , and the…",
    "url": "https://cloudfour.com/thinks/when-to-nest-css/",
    "date": "2024-03-21T00:00:00.000Z"
  },
  {
    "title": "Subgrid is here",
    "content": "Support for subgrid (part of the CSS Grid Level 2 specification has just landed in Firefox Nightly! To start experimenting with it you’ll need to enable the…",
    "url": "https://css-irl.info/subgrid-is-here/",
    "date": "2024-03-26T00:00:00.000Z"
  },
  {
    "title": "Own Your Web – Issue 12: Finding Your Rhythm",
    "content": "t is one of the most common reasons why we abandon our personal sites and blogs: at some point, we stop publishing. But why? Weren’t we so…",
    "url": "https://buttondown.email/ownyourweb/archive/issue-12/",
    "date": "2024-03-26T00:00:00.000Z"
  },
  {
    "title": "The IndieWeb is the new and the old web",
    "content": " When I first started developing websites back in 2000 the internet was a much simpler place. Google existed, but most people still used Yahoo or Ask Jeeves to…",
    "url": "https://www.alexhyett.com/newsletter/the-indie-web-is-the-new-and-the-old-web/",
    "date": "2024-03-26T00:00:00.000Z"
  },
  {
    "title": "The Discovery Phase in UX Projects",
    "content": "In This Article: Introduction Discovery: A preliminary phase in the UX-design process that involves researching the problem space, framing the problem(s) to be…",
    "url": "https://www.nngroup.com/articles/discovery-phase/",
    "date": "2024-03-28T00:00:00.000Z"
  },
  {
    "title": "Using Gitea/Github actions for triggering Echo",
    "content": "I decided to start using Robb Knight’s Echo tool, to syndicate my blog posts to Mastodon, and trigger Webmentions. I’m not going to go through the configuration…",
    "url": "https://lewisdale.dev/post/using-gitea-github-actions-for-triggering-echo/",
    "date": "2024-03-28T00:00:00.000Z"
  },
  {
    "title": "CSS color-scheme-dependent colors with light-dark()",
    "content": "System colors have the ability to react to the current used color-scheme value. The light-dark() function exposes the same capability to authors. Bramus System…",
    "url": "https://web.dev/articles/light-dark",
    "date": "2024-03-28T00:00:00.000Z"
  },
  {
    "title": "How would you build a complex app with vanilla tech?",
    "content": "The other day on Mastodon, Hawk Ticehurst asked… If you were asked to build a “proper complex” web application (let’s say a full featured mastodon client or…",
    "url": "https://gomakethings.com/how-would-you-build-a-complex-app-with-vanilla-tech/",
    "date": "2024-03-29T00:00:00.000Z"
  },
  {
    "title": "Building Dynamic Progress Bars using only CSS",
    "content": "Here’s a full disclaimer upfront: This isn’t something I’ve come up with. Jeffery Way from Laracasts has come up with this technique in one of the videos and…",
    "url": "https://www.amitmerchant.com/dynamic-progress-bars-using-css/",
    "date": "2024-03-29T00:00:00.000Z"
  },
  {
    "title": "disabled vs aria-disabled on form elements",
    "content": "I'll definitely reference the following blog post in the future. Kitty Giraudel describes when to use disabled and aria-disabled. Ready? Because here comes some…",
    "url": "https://www.stefanjudis.com/notes/disabled-vs-aria-disabled-on-form-elements/",
    "date": "2024-03-30T00:00:00.000Z"
  },
  {
    "title": "Using Eleventy to Gobble Up Everything I Do Online",
    "content": "This post is adapted from the talk I did at the Eleventy Meetup. You can also watch the talk on YouTube. This is what I look like when I try to…",
    "url": "https://rknight.me/blog/using-eleventy-to-gobble-up-everything-i-do-online/",
    "date": "2024-03-31T00:00:00.000Z"
  },
  {
    "title": "Front-end development’s identity crisis",
    "content": "I’m not a “[full-stack] developer”, regardless of what my last job title says. I’m not even a front-end developer, thanks to the JavaScript–industrial complex.…",
    "url": "https://ellyloel.com/blog/front-end-development-s-identity-crisis/",
    "date": "2024-04-02T00:00:00.000Z"
  },
  {
    "title": "Best practices for writing CSS and JavaScript with a team",
    "content": "Yesterday, I wrote about the importance of understanding the medium that we work in. Today, I wanted to share my best practices for writing code with a team.…",
    "url": "https://gomakethings.com/best-practices-for-writing-css-and-javascript-with-a-team/",
    "date": "2024-04-02T00:00:00.000Z"
  },
  {
    "title": "CSS variables",
    "content": "Yesterday, I mentioned that I love CSS variables. Today, I thought I’d explain what they are and how they work, for those who aren’t already familiar with them…",
    "url": "https://gomakethings.com/css-variables/",
    "date": "2024-04-03T00:00:00.000Z"
  },
  {
    "title": "Have we forgotten how to build ethical things for the web?",
    "content": "I've worked on a few projects where values and ethics were a key part of the clients' mission. They weren't putting profits over everything, they were trying to…",
    "url": "https://www.nicchan.me/blog/have-we-forgotten-how-to-build-ethical-things-for-the-web/",
    "date": "2024-04-03T00:00:00.000Z"
  },
  {
    "title": "An advanced way to use CSS variables",
    "content": "Yesterday, we learned about CSS variables. Today, I wanted to show you an advanced approach to working with them that I often use with client projects. Let’s…",
    "url": "https://gomakethings.com/an-advanced-way-to-use-css-variables/",
    "date": "2024-04-04T00:00:00.000Z"
  },
  {
    "title": "5 Things Designers Need to Know for a Smooth Handoff",
    "content": "There’s no truth teller quite like Google autocomplete. As you type “Design development handoff is…” into the search bar, it quickly fills in the blank with…",
    "url": "https://www.figma.com/blog/5-things-designers-need-to-know-for-a-smooth-handoff/",
    "date": "2024-04-04T00:00:00.000Z"
  },
  {
    "title": "Your Cache Headers Could Probably be More Aggressive",
    "content": "We've got it real good when it comes to standing up websites these days (especially static ones). Modern hosts like Vercel and Netlify take care of a lot out of…",
    "url": "https://macarthur.me/posts/more-aggressive-cache-headers/",
    "date": "2024-04-05T00:00:00.000Z"
  },
  {
    "title": "Embeds and Quotations in Writing",
    "content": "Chris wrote “0 KB Social Media Embeds” and it got me thinking about my own approach to embeds and quotations in my writing. A lot of my blogging is quoting…",
    "url": "https://blog.jim-nielsen.com/2023/embeds-and-quotations/",
    "date": "2024-04-05T00:00:00.000Z"
  },
  {
    "title": "Web dev craftsmanship",
    "content": "I’m coming to realize that a lot of my dissatisfaction with the state of the web is that I view web development as a craft, but as a profession we’re in the…",
    "url": "https://gomakethings.com/web-dev-craftsmanship/",
    "date": "2024-04-08T00:00:00.000Z"
  },
  {
    "title": "My wander page",
    "content": "One of my favourite pastimes is clicking around the blogosphere, exploring and reading personal websites. I especially love encountering blogrolls or link…",
    "url": "https://jamesg.blog/2024/04/08/wander/",
    "date": "2024-04-08T00:00:00.000Z"
  },
  {
    "title": "Figma prototypes vs HTML prototypes",
    "content": "When you design a product, you should usability test it. Otherwise, you won’t know how well it works. Typically you either: create and test a…",
    "url": "https://adamsilver.io/blog/figma-prototypes-vs-html-prototypes/",
    "date": "2024-04-09T00:00:00.000Z"
  },
  {
    "title": "Git Fresh",
    "content": "I don’t know if this is a personal quirk or a side effect of my role (designer first, developer second), but my Git branchs…",
    "url": "https://tylersticka.com/journal/git-fresh/",
    "date": "2024-04-09T00:00:00.000Z"
  },
  {
    "title": "Blockin’ bots",
    "content": "I’ve been blocking various “artificial intelligence” (“AI”) bots on my site. Why, you ask? Well, I don’t like the idea of my work being hoovered up to train…",
    "url": "https://ethanmarcotte.com/wrote/blockin-bots/",
    "date": "2024-04-13T00:00:00.000Z"
  },
  {
    "title": "The joy of incremental website improvements",
    "content": "Back in the pandemic, as my personal website started to become a comfort in difficult times, I often asked myself: what can I do with my website this weekend? I…",
    "url": "https://jamesg.blog/2024/03/04/incremental-website-improvements-joy/",
    "date": "2024-04-13T00:00:00.000Z"
  },
  {
    "title": "Enhancing pagination with a page selector",
    "content": "I’ve made a change to my site’s pagination wherein I’ve enhanced the page count displayed at the bottom of my home and links pages to display the page count in…",
    "url": "https://coryd.dev/posts/2024/enhancing-pagination-with-a-page-selector/",
    "date": "2024-04-13T00:00:00.000Z"
  },
  {
    "title": "How to display language-specific quotes in CSS",
    "content": "Will Boyd's excellent article Diving into the ::before and ::after Pseudo-Elements includes nifty details about CSS quotes. Let's say you're dealing with a…",
    "url": "https://www.stefanjudis.com/today-i-learned/how-to-use-language-dependent-quotes-in-css/",
    "date": "2024-04-15T00:00:00.000Z"
  },
  {
    "title": "Faster Connectivity !== Faster Websites",
    "content": "This post from Dan Luu discussing how web bloat impacts users with slow devices caused me to reflect on the supposition that faster connectivity means faster…",
    "url": "https://blog.jim-nielsen.com/2024/faster-bandwidth-and-websites/",
    "date": "2024-04-15T00:00:00.000Z"
  },
  {
    "title": "Own Your Web – Issue 13: Now",
    "content": "There are many pages you can add to your personal site that people can visit if they want to learn more about you. A “contact” page or an “about” page…",
    "url": "https://buttondown.email/ownyourweb/archive/issue-13/",
    "date": "2024-04-15T00:00:00.000Z"
  },
  {
    "title": "link-peek Web Component",
    "content": " The link-peek Web Component allows you to turn a regular anchor link to a rich preview (also known as an 'unfurled' link) to show description, meta image,…",
    "url": "https://darn.es/link-peek-web-component/",
    "date": "2024-04-17T00:00:00.000Z"
  },
  {
    "title": "Blogging Anonymously",
    "content": "While surfing the web this weekend, I saw a curious question from Kev Quirk on Mastodon, attached to a blog post: What About…",
    "url": "https://flamedfury.com/posts/blogging-anonymously/",
    "date": "2024-04-17T00:00:00.000Z"
  },
  {
    "title": "Index images, videos and news with specialized sitemaps",
    "content": "If you take the time to create content online, you probably want people to read it. It doesn't have to go viral, but it'd be nice if some folks read it, right?…",
    "url": "https://www.stefanjudis.com/today-i-learned/image-video-news-sitemaps/",
    "date": "2024-04-17T00:00:00.000Z"
  },
  {
    "title": "A Cheatsheet for User Interview and Follow Ups Questions",
    "content": "When I prepare user interviews (or usability tests), I end up coming back to the same resources again. I decided to put them all in one single place. If you…",
    "url": "https://stephaniewalter.design/blog/a-cheatsheet-for-user-interview-and-follow-ups-questions/",
    "date": "2024-04-17T00:00:00.000Z"
  },
  {
    "title": "Will Web Components replace React and Vue?",
    "content": "Over the weekend, I sent an email to my newsletter subscribers asking them what kinds of things they’d like to learn about Web Components. One of the most…",
    "url": "https://gomakethings.com/will-web-components-replace-react-and-vue/",
    "date": "2024-04-23T00:00:00.000Z"
  },
  {
    "title": "Re-creating the ‘His Dark Materials’ Logo in CSS",
    "content": "I love the new BBC adaptation of Philip Pullman’s His Dark Materials trilogy of novels. There’s also some pretty nice graphic design to appreciate. I’m a sucker…",
    "url": "https://css-irl.info/recreating-the-his-dark-materials-logo-in-css/",
    "date": "2024-04-23T00:00:00.000Z"
  },
  {
    "title": "Your first Web Component",
    "content": "Yesterday, we talked about why Web Components won’t replace React or Vue. Today, let’s look at how to create your first Web Component. Let’s dig in! A really…",
    "url": "https://gomakethings.com/your-first-web-component/",
    "date": "2024-04-24T00:00:00.000Z"
  },
  {
    "title": "Adding options to your Web Component",
    "content": "Yesterday, we learned how to create your first Web Component. Today, we’ll learn how to add options and settings. Let’s dig in! Our Web Component We’ve got our…",
    "url": "https://gomakethings.com/adding-options-to-your-web-component/",
    "date": "2024-04-24T00:00:00.000Z"
  },
  {
    "title": "Deploying An 11ty Project To Shared Hosting",
    "content": "When discussing hosting options for personal websites, the usual suspects are mentioned: Netlify,…",
    "url": "https://flamedfury.com/posts/deploying-an-11ty-project-to-shared-hosting/",
    "date": "2024-04-26T00:00:00.000Z"
  },
  {
    "title": "Eleventy Nested Pagination",
    "content": "Eleventy (the cool static site generator) has a great feature called Pagination which allows you to iterate over a list of things in chunks and…",
    "url": "https://www.codeflood.net/blog/2024/04/17/11ty-nested-pagination/",
    "date": "2024-04-26T00:00:00.000Z"
  },
  {
    "title": "Don’t use the maxlength attribute to stop users from exceeding the limit",
    "content": "Have you heard of the “error prevention” heuristic? It means “do everything you can so users don’t make mistakes”. And it’s good advice. But some…",
    "url": "https://adamsilver.io/blog/dont-use-the-maxlength-attribute-to-stop-users-from-exceeding-the-limit/",
    "date": "2024-04-28T00:00:00.000Z"
  },
  {
    "title": "JSON RSS feed I quickly created a JSON feed for this website",
    "content": "While setting up Echo Feed to mirror my blog posts on the fediverse, I’ve discovered…",
    "url": "https://minutestomidnight.co.uk/blog/json-rss-feed/",
    "date": "2024-04-28T00:00:00.000Z"
  },
  {
    "title": "Progressively enhancing a Web Component",
    "content": "This week, we’ve looked at how Web Components are different from React, how to create your first Web Component, and how to add options to a Web Component.…",
    "url": "https://gomakethings.com/progressively-enhancing-a-web-component/",
    "date": "2024-04-28T00:00:00.000Z"
  },
  {
    "title": "My approach to HTML web components",
    "content": "I’ve been deep-diving into HTML web components over the past few weeks. I decided to refactor the JavaScript on The Session to use custom elements wherever it…",
    "url": "https://adactio.com/journal/21078",
    "date": "2024-04-30T00:00:00.000Z"
  },
  {
    "title": "The different ways to instantiate a Web Component",
    "content": "As part of this ongoing series on Web Components, we’ve created our first Web Component, learned how to add options and settings, and learned how to…",
    "url": "https://gomakethings.com/the-different-ways-to-instantiate-a-web-component/",
    "date": "2024-04-30T00:00:00.000Z"
  },
  {
    "title": "What are you interested in?",
    "content": "You may or may not be aware of the /about, /ideas, /now, and /uses page initiatives[1] [2], where website authors are encouraged to create pages on their…",
    "url": "https://chrisburnell.com/note/slash-interests/",
    "date": "2024-05-01T00:00:00.000Z"
  },
  {
    "title": "Web Component lifecycle methods",
    "content": "Yesterday, we learned about the different ways to instantiate a Web Component. In the article, I mentioned the connectedCallback() lifecycle method. Today,…",
    "url": "https://gomakethings.com/the-web-component-lifecycle-methods/",
    "date": "2024-05-01T00:00:00.000Z"
  },
  {
    "title": "User Interviews 101",
    "content": "A user interview is a popular UX research method often used in the discovery phase. User interview: A research method where the interviewer asks participants…",
    "url": "https://www.nngroup.com/articles/user-interviews/",
    "date": "2024-05-06T00:00:00.000Z"
  },
  {
    "title": "Securing client-side JavaScript",
    "content": "I mentioned that I overhauled the JavaScript on The Session recently. That wasn’t just so that I could mess about with HTML web components. I’d been meaning to…",
    "url": "https://adactio.com/journal/21104",
    "date": "2024-05-06T00:00:00.000Z"
  },
  {
    "title": "A quick light-dark() experiment",
    "content": "I wanted to experiment with the new CSS function light-dark() and get a sense of how to use it in a CSS architecture of nested (web) components. I think it’s…",
    "url": "https://daverupert.com/2024/05/light-dark-experiment/",
    "date": "2024-05-06T00:00:00.000Z"
  },
  {
    "title": "How to get different Web Components to talk to each other (part 2)",
    "content": "Yesterday, we learned how to connect a child and parent Web Component to each other. Today, we’re going to look at how to use custom events to provide a more…",
    "url": "https://gomakethings.com/how-to-get-different-web-components-to-talk-to-each-other-part-2/",
    "date": "2024-05-07T00:00:00.000Z"
  },
  {
    "title": "Building a Localised Site with 11ty, Sanity &amp; Netlify",
    "content": "In this article, we'll explore how I built a localised website for a client of mine using 11ty, Sanity, and Netlify. Recently, I had the task of converting the…",
    "url": "https://www.ryangittings.co.uk/blog/jamstack-localisation-11ty-netlify-sanity/",
    "date": "2024-05-07T00:00:00.000Z"
  },
  {
    "title": "How to get different Web Components to talk to each other (part 1)",
    "content": "This morning, I had multiple people ask me how you can nest Web Components inside each other and share information from one to another. Today, we’re going to…",
    "url": "https://gomakethings.com/how-to-get-different-web-components-to-talk-to-each-other-part-1/",
    "date": "2024-05-08T00:00:00.000Z"
  },
  {
    "title": "Why use Web Components over traditional DOM manipulation?",
    "content": "If you’ve been following my articles on HTML Web Components, you may have come away thinking… This looks a lot like traditional DOM manipulation. And you’d be…",
    "url": "https://gomakethings.com/why-use-web-components-over-traditional-dom-manipulation/",
    "date": "2024-05-09T00:00:00.000Z"
  },
  {
    "title": "The /interests Directory",
    "content": "I made a directory for /interests pages! If you’ve built your own, why not submit it to the list! Just over a week ago, I published What are you interested in?…",
    "url": "https://chrisburnell.com/note/interests-directory/",
    "date": "2024-05-09T00:00:00.000Z"
  },
  {
    "title": "A Brief Note on Highlighted Text",
    "content": "TL;DR: If you plan to style text highlighted by the browser, you must give it sufficient contrast — 3:1 for the highlight block against its…",
    "url": "https://adrianroselli.com/2024/05/a-brief-note-on-highlighted-text.html",
    "date": "2024-05-09T00:00:00.000Z"
  },
  {
    "title": "Interests: A New Sitelet",
    "content": "Okay so maybe the definition of sitelet doesn't quite fit but it's close enough to describe these common pages people have on their…",
    "url": "https://rknight.me/blog/interests-a-new-sitelet/",
    "date": "2024-05-11T00:00:00.000Z"
  },
  {
    "title": "Target=_blank implies rel=noopener",
    "content": "f you want to be a good web citizen, you might be aware of the target=\"_blank\" security issue. In the old days, when you linked to a site and wanted to open a…",
    "url": "https://www.stefanjudis.com/today-i-learned/target-blank-implies-rel-noopener/",
    "date": "2024-05-13T00:00:00.000Z"
  },
  {
    "title": "View transitions and stacking context",
    "content": "Why does my CSS View Transition ignore z-index? - Nic Chan,  The problem Readers Of The Blog™ may know that I have been experimenting with the View Transitions API as a way to provide animations in my new portfolio site…",
    "url": "https://www.nicchan.me/blog/view-transitions-and-stacking-context/",
    "date": "2024-05-13T00:00:00.000Z"
  },
  {
    "title": "How to listen to multiple events in a Web Component with the handleEvent() method",
    "content": "In a previous article, I wrote about the handleEvent() method for working with event listeners in Web Components. Today, let’s look at how we can use that to…",
    "url": "https://gomakethings.com/how-to-listen-to-multiple-events-in-a-web-component-with-the-handleevent-method/",
    "date": "2024-05-17T00:00:00.000Z"
  },
  {
    "title": "Web Security Basics: XSS",
    "content": "I decided to learn more about areas of web development I don’t know a lot about. You know,…stuff like SEO and web…",
    "url": "https://www.matuzo.at/blog/2022/web-security-basics-xss",
    "date": "2024-05-19T00:00:00.000Z"
  },
  {
    "title": "Some of my Eleventy Filters",
    "content": "Before diving in, I think it’s helpful here to note that these filters are defined using JavaScript and made available to use as Nunjucks filters in my Eleventy…",
    "url": "https://chrisburnell.com/article/some-eleventy-filters/",
    "date": "2024-05-19T00:00:00.000Z"
  },
  {
    "title": "RSS is Good, Isn’t It?!",
    "content": "My son gets a weekly magazine delivered to our home. It’s full of his favourite comic strips by fantastic authors and artists, he gets the pleasure of receiving…",
    "url": "https://css-irl.info/rss-is-good-isnt-it/",
    "date": "2024-05-19T00:00:00.000Z"
  },
  {
    "title": "Futuristic Progressive Enhancement",
    "content": "Imagine someone came to you in a time machine and said, “In the future we will write software that becomes more capable as time passes without any effort on our…",
    "url": "https://blog.jim-nielsen.com/2024/futuristic-progressive-enhanement/",
    "date": "2024-05-20T00:00:00.000Z"
  },
  {
    "title": "Buried Bookworm",
    "content": "’ve been tracking books that I read since 2015, and, frankly, I’m pretty embarassed at how little I read these days. To be fair, there were periods of time…",
    "url": "https://chrisburnell.com/note/buried-bookworm/",
    "date": "2024-05-20T00:00:00.000Z"
  },
  {
    "title": "Design interviews",
    "content": "I’ve been doing a lot of interviews for designers lately so here’s a list of all the questions I’m asking along the way and maybe this helps someone out there…",
    "url": "https://robinrendle.com/notes/design-interviews/",
    "date": "2024-05-21T00:00:00.000Z"
  },
  {
    "title": "CSS is fun again",
    "content": "CSS has been undergoing a quiet renaissance lately. Lots of big features which previously required an external tool to use, are now native parts of the…",
    "url": "https://pdx.su/blog/2023-10-25-css-is-fun-again/",
    "date": "2024-05-21T00:00:00.000Z"
  },
  {
    "title": "Upgraded to Eleventy v3",
    "content": "The alpha release of Eleventy v3 became available in December '23. It took me a little while, but I finally upgraded this website to v3.0.0-alpha.10 today. This…",
    "url": "https://ttntm.me/blog/upgraded-to-eleventy-v3/",
    "date": "2024-05-23T00:00:00.000Z"
  },
  {
    "title": "Slash Pages",
    "content": "Don't care about the backstory? Go check out slashpages.net. While putting Baby Knight to bed I had an idea for a project: a…",
    "url": "https://rknight.me/blog/slash-pages/",
    "date": "2024-05-23T00:00:00.000Z"
  },
  {
    "title": "More Indieweb Automation",
    "content": "Follow-up to a previous case study on how I automated my static website publishing workflow. This time, a lean Shortcut script is allowing me to write…",
    "url": "https://minutestomidnight.co.uk/blog/more-indieweb-automation/",
    "date": "2024-05-24T00:00:00.000Z"
  },
  {
    "title": "Dynamic Content Includes",
    "content": "Those of you who have been following along with my posts this month may have noticed that I’m participating in Weblog Posting Month 2024. At the end of each of…",
    "url": "https://chrisburnell.com/article/dynamic-content-includes/",
    "date": "2024-05-24T00:00:00.000Z"
  },
  {
    "title": "Thinking Big and Small",
    "content": "It’s so easy to start with the question, “What should I do?” And end up with a discussion about other people and what they’re doing. Here’s Paul Ford: I’ll give…",
    "url": "https://blog.jim-nielsen.com/2024/thinking-big-and-small/",
    "date": "2024-05-24T00:00:00.000Z"
  },
  {
    "title": "But what about the shadow DOM?",
    "content": "I got a lot of responses to my article yesterday about the wrong way to build Web Components that insisted that “HTML only shows when the JavaScript loads” is a…",
    "url": "https://gomakethings.com/but-what-about-the-shadow-dom/",
    "date": "2024-05-24T00:00:00.000Z"
  },
  {
    "title": "The Times You Need A Custom @property Instead Of A CSS Variable",
    "content": "The Times You Need A Custom @property Instead Of A CSS Variable About The Author Preethi is a web developer and writer. She jots down mostly on…",
    "url": "https://www.smashingmagazine.com/2024/05/times-need-custom-property-instead-css-variable/",
    "date": "2024-05-24T00:00:00.000Z"
  },
  {
    "title": "Misconceptions about CSS Specificity",
    "content": "Me talking about Specificity (and the Cascade) Whenever a post about Specificity in CSS – and by extension the Cascade itself – gets published…",
    "url": "https://www.bram.us/2024/05/05/misconceptions-about-css-specificity/",
    "date": "2024-05-25T00:00:00.000Z"
  },
  {
    "title": "Re: Blocking Bots",
    "content": "Inspired by Neil Clarke and Ethan Marcotte, I moved my list of crawlers to a Jekyll YAML data file, and now use it to compile both the .htaccess and robots.txt…",
    "url": "https://minutestomidnight.co.uk/blog/re-blocking-bots/",
    "date": "2024-05-25T00:00:00.000Z"
  },
  {
    "title": "A Multiplicity of Writing",
    "content": "On this site, I write and publish in a variety of different forms, each serving their own unique purpose. I want to describe what these different are and how...",
    "url": "https://shellsharks.com/multiplicity-of-writing",
    "date": "2024-05-25T00:00:00.000Z"
  },
  {
    "title": "The key to side project success",
    "content": "The key to side project success Posted on: 31 October 2023 Most start-ups fail. Intuitively, they fail because they run out of money. But what’s the biggest…",
    "url": "https://samdking.co.uk/blog/mvp/",
    "date": "2024-05-27T00:00:00.000Z"
  },
  {
    "title": "The prefers-reduced-transparency media feature",
    "content": "The prefers-reduced-transparency media feature posted on 01.11.2023 It’s time to get me up to speed with modern CSS. There’s so much new in CSS that I…",
    "url": "https://www.matuzo.at/blog/2023/100daysof-day103",
    "date": "2024-05-28T00:00:00.000Z"
  },
  {
    "title": "Progressively Enhanced Popover Toggletips",
    "content": "The CSS Anchor Positioning specification enables us to position elements relative to an anchor, wherever they are in our web page. As I wrote recently, one…",
    "url": "https://css-irl.info/progressively-enhanced-popover-toggletips/",
    "date": "2024-05-28T00:00:00.000Z"
  },
  {
    "title": "Old Dogs, new CSS Tricks",
    "content": "A lot of new CSS features have shipped in the last years, but actual usage is still low. While there are many different reasons for the slow adoption, I think…",
    "url": "https://mxb.dev/blog/old-dogs-new-css-tricks/",
    "date": "2024-05-29T00:00:00.000Z"
  },
  {
    "title": "The New CSS Math: rem() and mod()",
    "content": "SS added many new Math functions to supplement the old favorites (think calc() and the more recent clamp() ). They all ultimately represent a…",
    "url": "https://danielcwilson.com/posts/mathematicss-rem-mod/",
    "date": "2024-05-29T00:00:00.000Z"
  },
  {
    "title": "Your site or app should work as much as possible without JavaScript",
    "content": "I’m amazed at how often this is a controversial opinion, but… your site or app should work as much as possible without JavaScript. The most common argument I…",
    "url": "https://gomakethings.com/your-site-or-app-should-work-as-much-as-possible-without-javascript/",
    "date": "2024-05-31T00:00:00.000Z"
  },
  {
    "title": "The different ways to build a resilient website or web app",
    "content": "Yesterday, I talked about how your site should work without JavaScript. Today, I wanted to talk about some different approaches for building a resilient website…",
    "url": "https://gomakethings.com/the-different-ways-to-build-a-resilient-website-or-web-app/",
    "date": "2024-05-31T00:00:00.000Z"
  },
  {
    "title": "A simpler way to build dynamic user interactions",
    "content": "Yesterday, we looked at two different ways to build more resilient websites and web apps. Today, let’s talk about how to add dynamic user interactions to static…",
    "url": "https://gomakethings.com/a-simpler-way-to-build-dynamic-user-interactions/",
    "date": "2024-06-01T00:00:00.000Z"
  },
  {
    "title": "External links and target=\"_blank\"",
    "content": "External links are everywhere, and I’m using tons of them on this rather small website. They’re often used as…",
    "url": "https://ttntm.me/blog/external-links-and-target-blank/",
    "date": "2024-06-01T00:00:00.000Z"
  },
  {
    "title": "Layout Update",
    "content": "Over the last few days, I’ve been working on some minor redesign of my website’s overall layout that I mentioned in yesterday’s post, Indent Outdent. After some…",
    "url": "https://chrisburnell.com/note/layout-update-may-2024/",
    "date": "2024-06-01T00:00:00.000Z"
  },
  {
    "title": "Exit Animations",
    "content": "How do you animate an element as it leaves the DOM? You can’t, is the historical answer. As soon as an element is removed from the DOM, it immediately…",
    "url": "https://chriscoyier.net/2023/10/30/exit-animations/",
    "date": "2024-06-03T00:00:00.000Z"
  },
  {
    "title": "Updating to Eleventy v3",
    "content": "I took some time this week to update my site to the newest version of Eleventy. Although v3.0.0 is still in alpha, I wanted to give it a try. This iteration of…",
    "url": "https://mxb.dev/blog/eleventy-v3-update/",
    "date": "2024-06-03T00:00:00.000Z"
  },
  {
    "title": "Why You Should Use px Units for margin, padding, & Other Spacing Techniques",
    "content": "Why are CSS margin and padding so closely related? The CSS margin and padding properties are often talked about together for two reasons: They both affect…",
    "url": "https://ashleemboyer.com//blog/why-you-should-use-px-units-for-margin-padding-and-other-spacing-techniques",
    "date": "2024-06-04T00:00:00.000Z"
  },
  {
    "title": "“Just” One Line",
    "content": "From Jeremy Keith’s piece “Responsibility”: Dropping in one line of JavaScript seems like a victimless crime. It’s just one small script, right? But JavaScript…",
    "url": "https://blog.jim-nielsen.com/2024/just-one-line/",
    "date": "2024-06-04T00:00:00.000Z"
  },
  {
    "title": "The challenge with Netlify, Vercel, Cloudflare, and so on",
    "content": "The other day, I wrote about how every dependency is a potential vulnerability. While that article as about third-party libraries and frameworks, you can make a…",
    "url": "https://gomakethings.com/the-challenge-with-netlify-vercel-cloudflare-and-so-on/",
    "date": "2024-06-07T00:00:00.000Z"
  },
  {
    "title": "Animation With Registered Custom Properties",
    "content": "Day 104: animation with registered custom properties posted on 02.11.2023 It’s time to get me up to speed with modern CSS. There’s so much new in CSS that I…",
    "url": "https://www.matuzo.at/blog/2023/100daysof-day104",
    "date": "2024-06-07T00:00:00.000Z"
  },
  {
    "title": "Maybe Don’t Name That Landmark",
    "content": "TL;DR: You probably don’t need to name that landmark. The Ngong Ping Village tourist trap on Hong Kong’s Lantau Island. All the pricey tourist…",
    "url": "ttps://adrianroselli.com/2024/06/maybe-dont-name-that-landmark.html",
    "date": "2024-06-11T00:00:00.000Z"
  },
  {
    "title": "Managing My Motivation, as a Solo Dev",
    "content": "One of the biggest sticking points of being a solo dev is maintaining motivation. I’ve been keeping a journal entry about how to hack my motivation, what works…",
    "url": "https://mbuffett.com/posts/maintaining-motivation/",
    "date": "2024-06-11T00:00:00.000Z"
  },
  {
    "title": "Modular CSS and different ways to structure your stylesheets",
    "content": "This week, I’ve written about classless vs. class-based CSS , and how I approach CSS architecture . I’ve also written a fair bit recently about how I’m starting…",
    "url": "https://gomakethings.com/modular-css-and-different-ways-to-structure-your-stylesheets/",
    "date": "2024-06-11T00:00:00.000Z"
  },
  {
    "title": "Compounding complexity in modern web development",
    "content": "I’d wager that most of the developers who build modern websites and web apps don’t start off thinking… I’m going to make this as complex as possible. Most of…",
    "url": "https://gomakethings.com/compounding-complexity-in-modern-web-development/",
    "date": "2024-06-19T00:00:00.000Z"
  },
  {
    "title": "Basic, beautiful, and buildless",
    "content": "I’m a big fan of the static site builder Eleventy. I’ve found the ability to put together a small site or landing page with minimum effort and complexity to be…",
    "url": "https://www.baldurbjarnason.com/2024/basic-beautiful-buildless/",
    "date": "2024-06-19T00:00:00.000Z"
  },
  {
    "title": "No No-JavaScript",
    "content": "I’m blogging this quick tip because the old technique is so ingrained I keep forgetting there is a new…",
    "url": "https://dbushell.com/2024/06/22/no-no-javascript/",
    "date": "2024-06-26T00:00:00.000Z"
  },
  {
    "title": "Consent, LLM scrapers, and poisoning the well",
    "content": " remember feeling numb learning that my writing had been sucked up by OpenAI. It came out of nowhere and was done without my permission or consent. I have a…",
    "url": "https://ericwbailey.website/published/consent-llm-scrapers-and-poisoning-the-well/",
    "date": "2024-06-26T00:00:00.000Z"
  },
  {
    "title": "Quick Trick: Using border-image to Apply and Overlay Gradient",
    "content": "I was watching Kevin Powell and Adam Argyle rapidfire through 23 CSS features. They are all cool tricks, but one stood out to me. Even as an extreme CSS…",
    "url": "https://frontendmasters.com/blog/quick-trick-using-border-image-to-apply-and-overlay-gradient/",
    "date": "2024-06-26T00:00:00.000Z"
  },
  {
    "title": "Every website and web app should have a service worker",
    "content": "A service worker is a special type of JavaScript file that acts like middleware for your site. Today, I want to talk about why every website and web app should…",
    "url": "https://gomakethings.com/every-website-and-web-app-should-have-a-service-worker/",
    "date": "2024-07-04T00:00:00.000Z"
  },
  {
    "title": "Google Spam",
    "content": "Robots accessing this content must agree to the copyright license terms at https://dbushell.com/copyright/ and ignore all…",
    "url": "https://dbushell.com/2024/07/03/google-spam/",
    "date": "2024-07-07T00:00:00.000Z"
  },
  {
    "title": "Feature detect CSS @property support",
    "content": "Today on Mastodon, Nils asked how to detect support for @property. While in theory you could use @supports at-rule() for this, in practice you can’t because it…",
    "url": "https://www.bram.us/2024/07/03/feature-detect-css-property-support/",
    "date": "2024-07-07T00:00:00.000Z"
  },
  {
    "title": "Vivaldi is quite good",
    "content": "Last year, I wrote about how all web browsers kind of suck. Every single one has turned into an AI-and-ad-driven piece of garbage. Amazing garbage that does…",
    "url": "https://gomakethings.com/vivaldi-is-quite-good/",
    "date": "2024-07-09T00:00:00.000Z"
  },
  {
    "title": "Highlighting Blogging on Mastodon",
    "content": "In what looks like a very smart move, the team at Mastodon just released a very nice new feature for media organizations, journalists and bloggers: when someone…",
    "url": "https://matthiasott.com/notes/highlighting-blogging-on-mastodon/",
    "date": "2024-07-09T00:00:00.000Z"
  },
  {
    "title": "Surprising Facts About New CSS Selectors",
    "content": "I went down a bit of a rabbit-hole recently learning about CSS Nesting , specifically regarding the new & selector. I heard that it behaves like the :is()…",
    "url": "https://cloudfour.com/thinks/surprising-facts-about-new-css-selectors/",
    "date": "2024-07-11T00:00:00.000Z"
  },
  {
    "title": "OKLCH for better color in the browser",
    "content": "Something that has always bugged me about CSS is the dullness of most gradients. You’d have this beautiful idea for your design, set up the gradient in your…",
    "url": "https://www.learnwithjason.dev/blog/oklch-better-color-css-browser/",
    "date": "2024-07-12T00:00:00.000Z"
  },
  {
    "title": "Feature detect CSS @starting-style support",
    "content": "The other day on Mastodon, Ryan wondered how hey can detect support for @starting-style. While in theory you could use @supports at-rule() for this, in practice…",
    "url": "https://www.bram.us/2024/07/11/feature-detect-css-starting-style-support/",
    "date": "2024-07-14T00:00:00.000Z"
  },
  {
    "title": "Is AI part and parcel of web dev?",
    "content": "Over the last year+ I've seen AI quickly increase its dominance in the social feeds I follow. I know I'm in an echo chamber, but it feels like working on the…",
    "url": "https://remysharp.com/2024/07/12/is-ai-part-and-parcel-of-web-dev",
    "date": "2024-07-14T00:00:00.000Z"
  },
  {
    "title": "Poisoning the AI well",
    "content": "AI is shit. There is no nuance to this for me. It steals other people’s work without permission, washes away copyright and attribution, and makes shit up. Most…",
    "url": "https://gomakethings.com/poisoning-the-ai-well/",
    "date": "2024-07-14T00:00:00.000Z"
  },
  {
    "title": "Helping to get quality code into production as an interaction designer",
    "content": "My notes on how interaction designers can work with software developers and testers on agile delivery teams. I shared this earlier in the week and wanted to…",
    "url": "https://www.benjystanton.co.uk/blog/helping-to-get-quality-code-into-production-as-an-interaction-designer/",
    "date": "2024-07-17T00:00:00.000Z"
  },
  {
    "title": "HTML & CSS for a One-Time Password Input",
    "content": "You know those One Time Password inputs? Typically 4 or 6 numbers, something like: Well I came across an article by Phuoc Nguyen about them called Build an OTP…",
    "url": "https://chriscoyier.net/2023/12/04/html-css-for-a-one-time-password-input/",
    "date": "2024-07-17T00:00:00.000Z"
  },
  {
    "title": "No JavaScript, No Problem",
    "content": "Last week, I pushed a big update to the Lean Web Club that removed all JavaScript dependencies. While most of the platform was server-rendered HTML stuff, some…",
    "url": "https://gomakethings.com/no-javascript-no-problem/",
    "date": "2024-07-17T00:00:00.000Z"
  },
  {
    "title": "Forms without an accessible name are not exposed as ARIA landmarks",
    "content": "Suppose you want to be a good web citizen; you use semantic and accessible HTML. Elements \"leading places\" are a elements, your navigation lives in a nav…",
    "url": "https://www.stefanjudis.com/today-i-learned/forms-require-an-accessible-name/",
    "date": "2024-07-20T00:00:00.000Z"
  },
  {
    "title": "You probably dont need HTML imports",
    "content": "For years, advocates of the lean web have lamented that there’s no such thing as HTML imports—me included. But turns out, you probably don’t actually need them…",
    "url": "https://gomakethings.com/you-probably-dont-need-html-imports/",
    "date": "2024-07-20T00:00:00.000Z"
  },
  {
    "title": "The many ways to hide things in the DOM",
    "content": "A few weeks ago in one of my YouTube videos, I used the [hidden] attribute to hide and show some elements in the DOM. One of my subscribers mentioned that they…",
    "url": "https://gomakethings.com/the-many-ways-to-hide-things-in-the-dom/",
    "date": "2024-07-21T00:00:00.000Z"
  },
  {
    "title": "Be Careful Using ‘Grid’",
    "content": "Be careful when using the word grid on its own. Be certain you have chosen the term that accurately describes the pattern you want. If this…",
    "url": "https://adrianroselli.com/2024/07/be-careful-using-grid.html",
    "date": "2024-07-23T00:00:00.000Z"
  },
  {
    "title": "Building a Custom Filter for Eleventy Collections",
    "content": "Collections and lists are a wonderful thing, and filters simply make them better. On this website, the first use case for a filterable collection was my whisky…",
    "url": "https://ttntm.me/blog/building-a-custom-filter-for-eleventy-collections/",
    "date": "2024-07-23T00:00:00.000Z"
  },
  {
    "title": "Quick Tip: How to Animate Text Gradients and Patterns in CSS",
    "content": "In this quick tip, we’ll show how easy it is to animate a background gradient with CSS. In a recent article, we showed how to set a background gradient on text…",
    "url": "https://www.sitepoint.com/css-animate-text-gradients-patterns/",
    "date": "2024-07-24T00:00:00.000Z"
  },
  {
    "title": "Communication Practices for Increasing UX Maturity",
    "content": "Improve your organization’s UX maturity by increasing UX awareness and knowledge through purposeful UX-related communication…",
    "url": "https://www.nngroup.com/articles/communication-practices/",
    "date": "2024-07-24T00:00:00.000Z"
  },
  {
    "title": "5 CSS snippets every front-end developer should know in 2024",
    "content": "Toolbelt worthy, powerful, and stable CSS you can use today. Adam Argyle GitHub Glitch Homepage I believe every front-end developer should know :has() is more…",
    "url": "https://web.dev/articles/5-css-snippets-every-front-end-developer-should-know-in-2024",
    "date": "2024-07-25T00:00:00.000Z"
  },
  {
    "title": "Three modern CSS properties your website must have",
    "content": "1. Scroll-margin Ever used an anchor link on a webpage, trying to find something, but got totally lost? It happens way too often. Usually the target elements…",
    "url": "https://bejamas.io/hub/guides/modern-css-properties-your-website-must-have",
    "date": "2024-07-25T00:00:00.000Z"
  },
  {
    "title": "Web content, the social contract and copyrights",
    "content": "I just updated the footer of this site. This is how it looks now. I'm going all corporate and legally official and stuff. Yeah — I hate it, too. You probably…",
    "url": "https://www.stefanjudis.com/blog/web-content-and-copyrights/",
    "date": "2024-07-25T00:00:00.000Z"
  },
  {
    "title": "The other shoe dropping on 'AI' and office work",
    "content": "From Burnout to Balance: AI-Enhanced Work Models for the Future Nearly half (47%) of workers using AI say they have no idea how to achieve the productivity…",
    "url": "https://www.baldurbjarnason.com/2024/the-other-ai-shoe-dropping/",
    "date": "2024-07-29T00:00:00.000Z"
  },
  {
    "title": "A modern CMS",
    "content": "I absolutely love static site generators. But their biggest weakness (when using them for clients and non-technical folks) is their lack of integrated CMS…",
    "url": "https://gomakethings.com/a-modern-cms/",
    "date": "2024-07-29T00:00:00.000Z"
  },
  {
    "title": "Losing is part of being a designer",
    "content": "Last Sunday I took a break from being a designer to play in the tennis men’s open singles finals. Not at Wimbledon. At my local club in North…",
    "url": "https://adamsilver.io/blog/losing-is-part-of-being-a-designer/",
    "date": "2024-07-30T00:00:00.000Z"
  },
  {
    "title": "Rebuilding The Web",
    "content": "What’s going on, Internet? This one has been bouncing around my head for months now, and I’ve had this draft open for the past three weeks…",
    "url": "https://flamedfury.com/posts/rebuilding-the-web/",
    "date": "2024-07-30T00:00:00.000Z"
  },
  {
    "title": "Using Figma variables for breakpoints",
    "content": "The hunt to find more use cases for local variables. At this point in 2023, almost all UX UI designers…",
    "url": "https://uxdesign.cc/using-figma-variables-for-breakpoints-eff321435306",
    "date": "2024-07-30T00:00:00.000Z"
  },
  {
    "title": "Why you need a killer web design proposal and how to write one",
    "content": "Buy the Killer Proposals template Proposals can also be effective selling tools, answering clients’ questions and encouraging them to hire you. Your goal should…",
    "url": "https://stuffandnonsense.co.uk/blog/why-you-need-a-killer-web-design-proposal-and-how-to-write-one",
    "date": "2024-07-31T00:00:00.000Z"
  },
  {
    "title": "Instability",
    "content": "I’ve been thinking a lot about how the web is changing. Here’s Nilay Patel: There’s a theory I’ve had for a long time that I’ve been calling “Google Zero” — my…",
    "url": "https://robinrendle.com/notes/instability/",
    "date": "2024-07-31T00:00:00.000Z"
  },
  {
    "title": "Displays May Be Ultra-Wide, But That Doesn't Mean Your Web Page Should Be",
    "content": "Chances are, you’ve likely visited a website whose design incorporates the full width of the browser. You may have noticed the content wasn’t easy to digest as…",
    "url": "https://martech.zone/optimal-web-page-width/",
    "date": "2024-08-01T00:00:00.000Z"
  },
  {
    "title": "Cascade Layers are useless",
    "content": "Cascade Layers are useless if you don‘t understand the problems they solve and use them in combination with other solutions that tackle…",
    "url": "https://www.matuzo.at/blog/2023/cascade-layers-are-useless",
    "date": "2024-08-04T00:00:00.000Z"
  },
  {
    "title": "Offloading JavaScript With Custom Properties",
    "content": "Sometimes a web development client doesn’t know quite what they want. Trying to guess is…",
    "url": "https://heydonworks.com/article/offloading-javascript-with-custom-properties/",
    "date": "2024-08-04T00:00:00.000Z"
  },
  {
    "title": "Just Build Websites",
    "content": "Here’s something you might not know about me: I like to play golf. As such, I follow a couple of golf-related brands on social media as a guilty pleasure. The…",
    "url": "https://blog.jim-nielsen.com/2024/just-build-websites/",
    "date": "2024-08-05T00:00:00.000Z"
  },
  {
    "title": "Own Your Web – Issue 15: Home Sweet Home",
    "content": "Let’s talk about the first thing many of your visitors will see and thus one of the most important places on any personal website: the home page. “The…",
    "url": "https://buttondown.email/ownyourweb/archive/issue-15/",
    "date": "2024-08-05T00:00:00.000Z"
  },
  {
    "title": "Bye bye build steps",
    "content": "I’m removing all build steps from all of my websites. I’m just so damn sick of having to install NPM scripts and run CLI commands every time I want to update my…",
    "url": "https://gomakethings.com/bye-bye-build-steps/",
    "date": "2024-08-07T00:00:00.000Z"
  },
  {
    "title": "Vanilla CSS and efficiencies over Sass",
    "content": "I wrote about how I ditched my Sass build step for vanilla CSS. As part of that process, I ended up refactoring a lot of code in a way that made it…",
    "url": "https://gomakethings.com/vanilla-css-and-efficiencies-over-sass/",
    "date": "2024-08-07T00:00:00.000Z"
  },
  {
    "title": "Highlight Text When a User Scrolls Down to That Piece of Text",
    "content": "I was reading a great post on Lene Saile’s blog and noticed a cool little design feature on her site that highlights a line of text once you scroll to it…",
    "url": "https://frontendmasters.com/blog/highlight-text-when-a-user-scrolls-down-to-that-piece-of-text/",
    "date": "2024-08-08T00:00:00.000Z"
  },
  {
    "title": "Design Patterns that Encourage Junk Data",
    "content": "A post from Remy on Mastodon recently got me thinking: Been picking up some of the jsbin archive work. Today, there's currently 62 millions bins stored. The…",
    "url": "https://css-irl.info/design-patterns-that-encourage-junk-data/",
    "date": "2024-08-08T00:00:00.000Z"
  },
  {
    "title": "A feed for everything and everything in a feed",
    "content": "At the moment my site has 6 different feeds. 5 RSS feeds, an ICS feeds and JSON versions of the 5 RSS feeds. I was asked how they're put together and, well…",
    "url": "https://coryd.dev/posts/2024/a-feed-for-everything-and-everything-in-a-feed/",
    "date": "2024-08-11T00:00:00.000Z"
  },
  {
    "title": "Flat files and data portability",
    "content": "The more I work with flat files, the more I love them over a traditional database setup. Let’s dig in! What is flat file storage? A flat is just a file you can…",
    "url": "https://gomakethings.com/flat-files-and-data-portability/",
    "date": "2024-08-11T00:00:00.000Z"
  },
  {
    "title": "Struggle and process",
    "content": "The way I’ve seen great work made isn’t using any sort of design process. It’s skipping steps when we deem them unnecessary. It’s doing them out of order just…",
    "url": "https://robinrendle.com/notes/struggle-and-process/",
    "date": "2024-08-11T00:00:00.000Z"
  },
  {
    "title": "My Failed Personal Site Redesign",
    "content": "tfw when you have an idea for a personal website redesign, and then you build it, and then you hate it, and then you have to decide whether to ship it anyway or…",
    "url": "https://blog.jim-nielsen.com/2024/my-failed-peronsal-site-redesign/",
    "date": "2024-08-15T00:00:00.000Z"
  },
  {
    "title": "The area element",
    "content": "If you’ve never killed a Tamagotchi, you’ve probably never used an <area> element. Like Tamagotchis, <area> elements used to be all the rage…",
    "url": "https://heydonworks.com/article/the-area-element/",
    "date": "2024-08-15T00:00:00.000Z"
  },
  {
    "title": "How to detect when attributes change on a Web Component",
    "content": "Yesterday, we looked at the Web Component lifecycle. While Web Components don’t have data reactivity, one of the lifecycle methods built into the Web Component…",
    "url": "https://gomakethings.com/how-to-detect-when-attributes-change-on-a-web-component/",
    "date": "2024-08-15T00:00:00.000Z"
  },
  {
    "title": "How to avoid optional form fields with a conditional reveal",
    "content": "The first rule of form design is to only ask for information you actually need to give users a good experience. But sometimes asking for…",
    "url": "https://adamsilver.io/blog/how-to-avoid-optional-form-fields-with-a-conditional-reveal/",
    "date": "2024-08-16T00:00:00.000Z"
  },
  {
    "title": "font-size Limbo",
    "content": "One point from Alvaro Montoro's CSS One-Liners post triggered me. Increase the text size body size…",
    "url": "https://sebastianlaube.de/en/blog/font-size-limbo",
    "date": "2024-08-16T00:00:00.000Z"
  },
  {
    "title": "What about searching flat files?",
    "content": "On Friday, I wrote about why I love using flat text files instead of a database for my projects. One of the more common questions I got was how I search for…",
    "url": "https://gomakethings.com/what-about-searching-flat-files/",
    "date": "2024-08-17T00:00:00.000Z"
  },
  {
    "title": "Things to Do Before Asking “Is This Accessible?”",
    "content": "It is not uncommon for someone to message, call, email, or carrier pigeon me to ask if something is accessible. They almost invariably want a…",
    "url": "https://adrianroselli.com/2024/08/things-to-do-before-asking-is-this-accessible.html",
    "date": "2024-08-17T00:00:00.000Z"
  },
  {
    "title": "80 / 20 accessibility",
    "content": "Many people are confronted with the topic of web accessibility for the first time as a result of the EAA (European Accessibility Act) (why this conftontation…",
    "url": "https://marcus.io/blog/80-20-accessibility",
    "date": "2024-08-18T00:00:00.000Z"
  },
  {
    "title": "heading-anchors Web Component",
    "content": "A long time ago, I wrote an article on how to add anchor links to headings in Jekyll. It got a fair amount of interest, and I was pretty pleased with the code I…",
    "url": "https://darn.es/heading-anchors-web-component/",
    "date": "2024-08-21T00:00:00.000Z"
  },
  {
    "title": "10 Figma Keyboard Shortcuts: A Cheat Sheet for UX Designers",
    "content": "As a UX Designer, working efficiently is always a priority—and leveraging the full power of your design tools can help. Figma offers a plethora of keyboard…",
    "url": "https://designlab.com/blog/10-figma-keyboard-shortcuts-a-cheat-sheet-for-ux-designers",
    "date": "2024-08-21T00:00:00.000Z"
  },
  {
    "title": "Blog Posts vs. Social Posts",
    "content": "From Emil Kowalski’s newsletter (my Feedbin cache for your convenience): I started writing more blog posts recently. I like it because it's different than X…",
    "url": "https://blog.jim-nielsen.com/2024/blog-vs-social-posts/",
    "date": "2024-08-22T00:00:00.000Z"
  },
  {
    "title": "The aside element",
    "content": "If you’re reading these HTML element guides alphabetically, you will have already read about <article> and learned what a sectioning element is.…",
    "url": "https://heydonworks.com/article/the-aside-element/",
    "date": "2024-08-28T00:00:00.000Z"
  },
  {
    "title": "New Workflow for Publishing Notes: Content in Dropbox, Code in GitHub",
    "content": "I recently changed my workflow around authoring and publishing my site notes.jim-nielsen.com. Here’s the rundown. Before Pretty standard JAMstack type stuff.…",
    "url": "https://blog.jim-nielsen.com/2024/notes-site-via-content-in-dropbox/",
    "date": "2024-08-28T00:00:00.000Z"
  },
  {
    "title": "Paragraphs",
    "content": "Consider the following: I am a paragraph. I am also a paragraph. You might hate it, but I'm a paragraph too. Even I am a paragraph. Though I'm a list item as…",
    "url": "https://www.scottohara.me/blog/2024/08/29/paragraphs.html",
    "date": "2024-08-29T00:00:00.000Z"
  },
  {
    "title": "Dynamic Importing with Eleventy",
    "content": "After organising Eleventy filters, shortcodes etc I had an idea to tidy the code even more and make it dynamic. I wanted to automatically import any new…",
    "url": "https://www.trovster.com/blog/2024/08/dynamic-importing-with-eleventy",
    "date": "2024-08-30T00:00:00.000Z"
  },
  {
    "title": "The secret inside One Million Checkboxes",
    "content": "A few days into making One Million Checkboxes I thought I’d been hacked. What was that doing in my database? A few hours later I was tearing up, proud of some…",
    "url": "http://eieio.games/essays/the-secret-in-one-million-checkboxes/",
    "date": "2024-08-30T00:00:00.000Z"
  },
  {
    "title": "Gardening and code",
    "content": "There’s a section of my yard where not much grows. We tried to get turf grass to grow for years. Wasted a ton of time, money, and resources on seeds, water,…",
    "url": "https://gomakethings.com/gardening-and-code/",
    "date": "2024-08-30T00:00:00.000Z"
  },
  {
    "title": "Hourly Billing Is Stopping Your Growth",
    "content": "Do you want to earn more, work less and be a more fulfilled freelancer?",
    "url": "https://www.kyleprinsloo.com/articles/stop-billing-hourly",
    "date": "2024-09-01T00:00:00.000Z"
  },
  {
    "title": "Organising Eleventy Filters, Shortcodes and more…",
    "content": "I work a lot with the Laravel framework, which scaffolds much of your initial setup and has conventions for where code should be stored. Starting a brand new…",
    "url": "https://www.trovster.com/blog/2024/08/organising-eleventy-filters-shortcodes-and-more",
    "date": "2024-09-01T00:00:00.000Z"
  },
  {
    "title": "Sanding UI",
    "content": "One of the ways I like to do development is to build something, click around a ton, make tweaks, click around more, more tweaks, more clicks, etc., until I…",
    "url": "https://blog.jim-nielsen.com/2024/sanding-ui/",
    "date": "2024-09-04T00:00:00.000Z"
  },
  {
    "title": "Different ways to use “--patch” in Git",
    "content": "I’ve written previously about using --patch to interactively stage changes. But did you know that you can use --patch (aka -p) to similar effect with other Git…",
    "url": "https://tekin.co.uk/2024/08/the-many-uses-for-git-patch",
    "date": "2024-09-04T00:00:00.000Z"
  },
  {
    "title": "Personal Websites Are As Vulnerable As Us",
    "content": "I look at some people’s personal websites and think, “Stupendous! If I ever reach that zenith of personal web design, I will call it quits.” Then I read a post…",
    "url": "https://blog.jim-nielsen.com/2024/personal-website-vulnerability/",
    "date": "2024-09-05T00:00:00.000Z"
  },
  {
    "title": "Popover API is Here",
    "content": "The Popover API has support across browsers now, and apparently the new way to say that is “landed in Baseline”, albeit as “newly available” rather than “widely…",
    "url": "https://frontendmasters.com/blog/popover-api-is-here/",
    "date": "2024-09-05T00:00:00.000Z"
  },
  {
    "title": "Basic accessibility mistakes I often see in audits",
    "content": "When I start working with new consulting clients , one of the first things I like to do is an audit of their existing site. I’m primarily looking for…",
    "url": "https://gomakethings.com/basic-accessibility-mistakes-i-often-see-in-audits/",
    "date": "2024-09-06T00:00:00.000Z"
  },
  {
    "title": "Auto Layout in Figma: to use or not to use?",
    "content": "Lately, I’ve been thinking a lot about the debate around auto layout in Figma. On one side, you’ve got designers who say skipping auto layout makes their work…",
    "url": "https://rafaltomal.ck.page/posts/auto-layout-in-figma-to-use-or-not-to-use",
    "date": "2024-09-17T00:00:00.000Z"
  },
  {
    "title": "Good forms",
    "content": "Brian LeRoux posted a few thoughts about forms and the idea of a “good form” resonated with me so I dogpiled some of my own thoughts and experiences on it.…",
    "url": "https://daverupert.com/2024/09/good-forms/",
    "date": "2024-09-17T00:00:00.000Z"
  },
  {
    "title": "Animating height with only CSS",
    "content": "I love ditching JavaScript for HTML and CSS whenever I can. It’s a core part of the Lean Web Club ethos. In particular, one of my favorite sets of HTML elements…",
    "url": "https://gomakethings.com/animating-height-with-only-css/",
    "date": "2024-10-01T00:00:00.000Z"
  },
  {
    "title": "Removing link underline styles between icons and text",
    "content": "I recently made a little update to my site with a blogroll that includes the linked site’s favicon. I think it’s good to have that icon be clickable, so I…",
    "url": "https://chriskirknielsen.com/blog/remove-link-underline-styling-between-icon-and-text/",
    "date": "2024-10-01T00:00:00.000Z"
  },
  {
    "title": "Should form labels be wrapped or separate?",
    "content": "Several times this year, I’ve answered variations of the following question: Is it strictly necessary for form fields and labels to have for/id association, or…",
    "url": "https://www.tpgi.com/should-form-labels-be-wrapped-or-separate/",
    "date": "2024-10-03T00:00:00.000Z"
  },
  {
    "title": "The role of Web Components in your site or app",
    "content": "Last week, Ryan Carniato, the guy who made SolidJS, wrote an article about how Web Components are not the future. The nicest thing I can say about it is that…",
    "url": "https://gomakethings.com/the-role-of-web-components-in-your-site-or-app/",
    "date": "2024-10-03T00:00:00.000Z"
  },
  {
    "title": "Putting the “Person” in “Personal Website”",
    "content": "The other day I saw a meme that went something like this: Isn’t it crappy how basic human activities like singing, dancing, and making art have been turned into…",
    "url": "https://blog.jim-nielsen.com/2024/person-in-personal-website/",
    "date": "2024-10-05T00:00:00.000Z"
  },
  {
    "title": "Going beyond pixels and (r)ems in CSS",
    "content": "Relative length units based on font - iO tech_hub   I will base this article on a list found at MDN as a reference but will add some extra upcoming things in the mix later on. The idea is that this is more than…",
    "url": "https://techhub.iodigital.com/articles/going-beyond-pixels-and-rems-in-css/relative-length-units-based-on-font",
    "date": "2024-10-16T00:00:00.000Z"
  },
  {
    "title": "A 4-step framework for crafting meaningful designs",
    "content": "Creating a successful design doesn't have to feel like wandering through a maze. There's a proven design…",
    "url": "https://uxdesign.cc/a-4-step-framework-for-crafting-meaningful-designs-ea9fca9b39b8",
    "date": "2024-10-20T00:00:00.000Z"
  },
  {
    "title": "As little code as possible",
    "content": "That should be the goal when writing code. As little of it as possible. I don’t mean in the code-golf, how-short-can-I-make-this-line-of-code kind of way…",
    "url": "https://gomakethings.com/as-little-code-as-possible/",
    "date": "2024-10-23T00:00:00.000Z"
  },
  {
    "title": "Top 10 Graphic Design Trends For 2024",
    "content": "As we navigate through 2024, the world of graphic design is buzzing with new and exciting trends that are reshaping the industry. This year has brought a lively…",
    "url": "https://graphicmama.com/blog/graphic-design-trends-2024/",
    "date": "2024-10-25T00:00:00.000Z"
  },
  {
    "title": "Getting Started With Style Dictionary",
    "content": "Design Tokens have become a widely-adopted method to store design decisions (such as colours, typography, spacing, border-radius, and other visual properties) across products, applications, and websites.",
    "url": "https://alwaystwisted.com/articles/a-design-tokens-workflow-part-1.html",
    "date": "2024-10-29T00:00:00.000Z"
  },
  {
    "title": "What Else Can We Do With Design Tokens?",
    "content": "Design Tokens are a solution in Design System that allow teams to define and use their design…",
    "url": "https://alwaystwisted.com/articles/what-else-can-we-do-with-design-tokens.html",
    "date": "2024-10-29T00:00:00.000Z"
  },
  {
    "title": "Outputting to Different Formats with Style Dictionary",
    "content": "In this article we will go through the other 'built-in' formats that are available, how to set them up, what they are for, and what they would look like.",
    "url": "https://alwaystwisted.com/articles/a-design-tokens-workflow-part-2.html",
    "date": "2024-11-01T00:00:00.000Z"
  },
  {
    "title": "Web Components and FOUC",
    "content": " My preferred style of authoring Web Components is to start with existing HTML and enhance it once the Web Component loads. For example, if I were building a…",
    "url": "https://gomakethings.com/web-components-and-fouc/",
    "date": "2024-11-01T00:00:00.000Z"
  },
  {
    "title": "Doing what’s required: Indicating mandatory fields in an accessible way",
    "content": "When filling in a form—be it signing up for a newsletter or applying for a credit card—you must provide a minimum…",
    "url": "https://www.tpgi.com/doing-whats-required-indicating-mandatory-fields-in-an-accessible-way/",
    "date": "2024-11-04T00:00:00.000Z"
  },
  {
    "title": "A CSS project boilerplate",
    "content": "When it comes to the core of CSS stuff, we do things very much the same each time at the studio. The output varies project-to-project, but the core principles…",
    "url": "https://piccalil.li/blog/a-css-project-boilerplate/",
    "date": "2024-11-09T00:00:00.000Z"
  },
  {
    "title": "How SVG Line Animation Works",
    "content": "I bet all of you have seen that little trick where an SVG path is animated to look like it’s drawing itself. It’s super cool. Jake Archibald pioneered the…",
    "url": "https://css-tricks.com/svg-line-animation-works/",
    "date": "2024-11-12T00:00:00.000Z"
  },
  {
    "title": "View transitions: Handling aspect ratio changes",
    "content": "This post assumes some knowledge of view transitions. If you're looking for a from-scratch intro to the feature, see this article. When folks ask me for help…",
    "url": "https://jakearchibald.com/2024/view-transitions-handling-aspect-ratio-changes/",
    "date": "2024-11-12T00:00:00.000Z"
  },
  {
    "title": "Playing with Infinity in CSS ",
    "content": "CSS has an infinity constant. When I first learned about this, my brain lit up with all kinds of absurd possibilities. Let’s discuss! There might even be some…",
    "url": "https://codersblock.com/blog/playing-with-infinity-in-css/",
    "date": "2024-11-17T00:00:00.000Z"
  },
  {
    "title": "Eleventy Transform speeds local development...a lot!",
    "content": "Ever since the Eleventy v3.0.0 came out and the new Eleventy Image plugin came out…",
    "url": "https://www.bobmonsour.com/posts/fast-as-hell/",
    "date": "2024-11-25T00:00:00.000Z"
  },
  {
    "title": "Syndicating to Bluesky",
    "content": "Back then my approach to syndicating to Bluesky was to piggy-back off my micro.blog account (which is really just the RSS feed of my notes): Micro.blog can also…",
    "url": "https://adactio.com/journal/21570",
    "date": "2024-11-25T00:00:00.000Z"
  },
  {
    "title": "Never half-ass two things",
    "content": "One alpha and one discovery I've finished my first sprint of being split between 2 services this week. I'm already feeling like it's not the most efficient use…",
    "url": "https://www.benjystanton.co.uk/blog/never-half-ass-two-things/",
    "date": "2024-11-27T00:00:00.000Z"
  },
  {
    "title": "Asking the right questions to frame the problem",
    "content": "Framing the problem is vital for designers. We need to be relentlessly talking about the core benefits that a product or service delivers, and why. I’ve found…",
    "url": "https://benholliday.com/2015/07/28/frame-the-problem/",
    "date": "2024-11-27T00:00:00.000Z"
  },
  {
    "title": "How to usability test your product (if you want bad UX)",
    "content": "On Friday, I met up with a friend for lunch. The day before, he’d been a research participant to taste-test 4 different brands of Jaffa cake…",
    "url": "https://adamsilver.io/blog/how-to-usability-test-your-product-if-you-want-bad-ux/",
    "date": "2024-12-02T00:00:00.000Z"
  },
  {
    "title": "How to Conduct a Design Audit in 2023: A Beginner’s Guide",
    "content": "Have you ever wished there was a way to determine if your website’s UX/UI design is delivering the value it’s supposed to? Enter: The design audit. A website…",
    "url": "https://designlab.com/blog/how-to-conduct-a-design-audit",
    "date": "2024-12-02T00:00:00.000Z"
  },
  {
    "title": "Using the Popover API for HTML Tooltips Can it be done?",
    "content": "This plucky front-end developer intends to find out. Can we do it? We looked at the Popover API and how it’s made it’s way across all browsers…",
    "url": "https://frontendmasters.com/blog/using-the-popover-api-for-html-tooltips/",
    "date": "2024-12-03T00:00:00.000Z"
  },
  {
    "title": "Using the ':not()' pseudo-class to remove styles from ':last-child'",
    "content": "I was re-designing the footer for my blog when I added a…",
    "url": "https://blog.stephaniestimac.com/posts/2024/12/not-pseudo-class/",
    "date": "2024-12-03T00:00:00.000Z"
  },
  {
    "title": "Turn off AI features by default (to reduce their climate impact)",
    "content": "Generative AI features have a large climate impact and water consumption. We can weigh that impact against those features' benefits, but what if they are left…",
    "url": "https://hidde.blog/please-make-ai-opt-in/",
    "date": "2024-12-04T00:00:00.000Z"
  },
  {
    "title": "Royal Mail? More like Royal FAIL",
    "content": "Last week my friend, Rachael got married. I ordered her a gift using MoonPig and arranged delivery for Tuesday (the day she’d arrive back). But…",
    "url": "https://adamsilver.io/blog/royal-mail-more-like-royal-fail/",
    "date": "2024-12-04T00:00:00.000Z"
  },
  {
    "title": "bluesky-replies Web Component",
    "content": "It's great to see the Web Components community grow on Bluesky. To help nurture it, I created a custom feed for Web Components as a topic if you're interested…",
    "url": "https://darn.es/bluesky-replies-web-component/",
    "date": "2024-12-06T00:00:00.000Z"
  },
  {
    "title": "Cool People Link to Text Fragments",
    "content": "Hyperlinks are cool. They’re what make the web, The Web. You know what’s…",
    "url": "https://dbushell.com/2024/12/05/url-fragment-text-directives/",
    "date": "2024-12-06T00:00:00.000Z"
  },
  {
    "title": "A Design Tokens Workflow (part 3) - Beyond JSON: Exploring File Formats for Design Tokens",
    "content": "Discover how to go beyond JSON and explore alternative file formats for design tokens in Style Dictionary. Learn to use YAML, JSON5, HJSON, and W3C-compliant…",
    "url": "https://alwaystwisted.com/articles/a-design-tokens-workflow-part-3.html",
    "date": "2024-12-07T00:00:00.000Z"
  },
  {
    "title": "A Design Tokens Workflow (part 4) - Converting Tokens with Style Dictionary",
    "content": "Learn how to transform Design Tokens for web, Android, iOS, and beyond with Style Dictionary. This guide covers key and value conversions, platform-specific naming…",
    "url": "https://alwaystwisted.com/articles/a-design-tokens-workflow-part-4.html",
    "date": "2024-12-07T00:00:00.000Z"
  },
  {
    "title": "Don’t Use aria-label on Static Text Elements",
    "content": "Don’t use the aria-label or aria-labelledby attributes on <div>s, <span>s, or other elements representing static/noninteractive text-level…",
    "url": "https://benmyers.dev/blog/dont-use-aria-label-on-static-text-elements/",
    "date": "2024-12-08T00:00:00.000Z"
  },
  {
    "title": "Responsive design is dead. Long live fluid design!",
    "content": "I’ve been thinking a lot about this lately. For years, responsive design has been our go-to solution for…",
    "url": "https://medium.com/design-bootcamp/responsive-design-is-dead-long-live-fluid-design-5c1609a8bf33",
    "date": "2025-01-03T00:00:00.000Z"
  },
  {
    "title": "Every token is a feature",
    "content": "I’m in the middle of a design tokens project and I thought I’d share something I’m learning that is probably obvious to everyone else; every design token is a…",
    "url": "https://daverupert.com/2024/12/every-token-is-a-feature/",
    "date": "2025-01-03T00:00:00.000Z"
  },
  {
    "title": "Custom attributes in Web Components",
    "content": "One of my favorite ways to customize Web Components is with custom attributes. Since writing that last article, I’ve gotten some questions around using custom…",
    "url": "https://gomakethings.com/custom-attributes-in-web-components/",
    "date": "2025-01-07T00:00:00.000Z"
  },
  {
    "title": "Default Apps 2024",
    "content": "There've been some folks sharing their 2024 default apps; let me join the fun! Heads up! Some of this post's links are affiliate links. If this rubs you the…",
    "url": "https://www.stefanjudis.com/blog/default-apps-2024/",
    "date": "2025-01-07T00:00:00.000Z"
  },
  {
    "title": "Slash Pages?",
    "content": "Sometimes I look at this list of “slash pages” and I’m like ughkgh I love these, I should do like all of them. Then something stops me and I think I’ve figured…",
    "url": "https://chriscoyier.net/2025/01/04/slash-pages/",
    "date": "2025-01-07T00:00:00.000Z"
  },
  {
    "title": "More ways to instantiate Web Components",
    "content": "Last week, we looked at different ways to setup the HTML in a Web Component. One of the challenges with running your code in the constructor() is that sometimes…",
    "url": "https://gomakethings.com/more-ways-to-instantiate-web-components/",
    "date": "2025-01-08T00:00:00.000Z"
  },
  {
    "title": "A quick and easy guide to Markdown",
    "content": "This guide is designed to help everyone with Markdown, even if they have never written it before. It is deliberately simple. There’s links to further resources…",
    "url": "https://piccalil.li/blog/a-quick-and-easy-guide-to-markdown/",
    "date": "2025-01-08T00:00:00.000Z"
  },
  {
    "title": "Anchor Positioning and the Popover API for a JS-Free Site Menu",
    "content": "Anchor positioning in CSS enables us to position an element relative to an anchor element anywhere on the page. Prior to this we could only position an element…",
    "url": "https://css-irl.info/anchor-positioning-and-the-popover-api/",
    "date": "2025-01-09T00:00:00.000Z"
  },
  {
    "title": "The wrong way to do Web Components",
    "content": "There’s not really a “wrong” way to build Web Components. But there are some approaches that are, in my opinion, antithetical to the spirit of them, and maybe…",
    "url": "https://gomakethings.com/the-wrong-way-to-do-web-components/",
    "date": "2025-01-13T00:00:00.000Z"
  },
  {
    "title": "Five Basic Things About JavaScript That Will Help Non JavaScript-Focused Web Designers",
    "content": "Let’s say you don’t know JavaScript. Like, at all. You haven’t needed it. You’re a web designer and you’re focused largely on UI and UX. Your skills with design…",
    "url": "https://frontendmasters.com/blog/5-things-designers-can-do-with-javascript/",
    "date": "2025-01-13T00:00:00.000Z"
  },
  {
    "title": "Gotchas in Naming CSS View Transitions",
    "content": "I’m playing with making cross-document view transitions work on this blog. Nothing fancy. Mostly copying how Dave Rupert does it on his site where you get a…",
    "url": "https://blog.jim-nielsen.com/2025/view-transition-name-gotchas/",
    "date": "2025-01-14T00:00:00.000Z"
  },
  {
    "title": "Using an 11ty Shortcode to craft a custom CSS pipeline",
    "content": "I know I'm still a bit of a 11ty n00b, so I hope this isn't frowned upon in the community, but on rebuilding my blog using 11ty, I decided not to use the…",
    "url": "https://nooshu.com/blog/2025/01/12/using-an-11ty-shortcode-to-craft-a-custom-css-pipeline/",
    "date": "2025-01-15T00:00:00.000Z"
  },
  {
    "title": "Best Practices for Optimizing Images",
    "content": "Our 10 most popular web performance articles of 2024 core web vitals javascript performance budgets metrics We love writing articles and blog posts that help…",
    "url": "https://www.speedcurve.com/blog/best-practices-for-optimizing-images",
    "date": "2025-01-15T00:00:00.000Z"
  },
  {
    "title": "CSS light-dark()",
    "content": "light-dark() makes it easy to build websites that respect the user's preferred color scheme while also providing the ability to override the color scheme…",
    "url": "https://12daysofweb.dev/2024/css-light-dark/",
    "date": "2025-01-19T00:00:00.000Z"
  },
  {
    "title": "Adding a Copy Button to Code Blocks",
    "content": "Copying code from code blocks, without having to manually select it all first, is very handy convenience feature. But despite having published a ton of code…",
    "url": "https://ttntm.me/blog/adding-a-copy-button-to-code-blocks/",
    "date": "2025-01-20T00:00:00.000Z"
  },
  {
    "title": "Don’t Wrap Figure in a Link",
    "content": "In my post Brief Note on Figure and Figcaption Support I demonstrate how, when encountering a figure with a screen reader, you won’t hear…",
    "url": "https://adrianroselli.com/2025/01/dont-wrap-figure-in-a-link.html",
    "date": "2025-01-20T00:00:00.000Z"
  },
  {
    "title": "Every dependency is a potential vulnerability ",
    "content": "Every piece of code is a potential vulnerability, really. Not just dependencies. But code that you don’t own, that’s outside your control, is particularly…",
    "url": "https://gomakethings.com/every-dependency-is-a-potential-vulnerability/",
    "date": "2025-01-22T00:00:00.000Z"
  },
  {
    "title": "The Times You Need A Custom @property Instead Of A CSS Variable",
    "content": "he Times You Need A Custom @property Instead Of A CSS Variable About The Author Preethi is a web developer and writer. She jots down mostly on…",
    "url": "https://www.smashingmagazine.com/2024/05/times-need-custom-property-instead-css-variable/",
    "date": "2025-01-22T00:00:00.000Z"
  },
  {
    "title": "Securing Buy-In for Your Design System: A Lifecycle Approach",
    "content": "Securing Buy-In for Your Design System: A Lifecycle Approach Discover how to secure stakeholder buy-in for a design system at every stage, from pre-building to…",
    "url": "https://www.supernova.io/blog/securing-buy-in-for-your-design-system-a-lifecycle-approach",
    "date": "2025-01-22T00:00:00.000Z"
  },
  {
    "title": "Investigating INP issues",
    "content": "I've been doing some client performance work lately. It's a Next.js project, and it looks like Google's INP update has punished it. Organic search rankings are…",
    "url": "https://www.stefanjudis.com/blog/investigating-inp-issues/",
    "date": "2025-01-28T00:00:00.000Z"
  },
  {
    "title": "Cool URIs Don’t Change — But Humans Do",
    "content": "Here are two ideas at odds with each other: You should have human-friendly URIs Cool URIs don’t change If a slug is going to be human-friendly…",
    "url": "https://blog.jim-nielsen.com/2024/cool-uris-and-humans/",
    "date": "2025-01-28T00:00:00.000Z"
  },
  {
    "title": "Filters",
    "content": "My phone rang today. I didn’t recognise the number so although I pressed the big button to answer the call, I didn’t say anything. I didn’t say anything because…",
    "url": "https://adactio.com/journal/21241",
    "date": "2025-01-28T00:00:00.000Z"
  },
  {
    "title": "Decline of web craftsmanship",
    "content": "Decline of web craftsmanship 27th June 2024 I was thinking back to the old days of a time where I spent a great deal of time creating a design and…",
    "url": "https://www.dan-davies.co.uk/decline-of-web-craftsmanship",
    "date": "2025-01-29T00:00:00.000Z"
  },
  {
    "title": "Accessibility in Design Systems: A Comprehensive Approach Through Documentation and Assets",
    "content": "Get inspired by Gestalt's documentation approach to help you develop an accessibility mindset that can be scaled effectively through your design system…",
    "url": "https://www.supernova.io/blog/accessibility-in-design-systems-a-comprehensive-approach-through-documentation-and-assets",
    "date": "2025-02-04T00:00:00.000Z"
  },
  {
    "title": "Not so short note on aria-label usage",
    "content": "An audience with Dr David Swallow wherein he outlines the existential threat to native labeling mechanisms posed by the use of aria-label…",
    "url": "https://html5accessibility.com/stuff/2024/05/22/not-so-short-note-on-aria-label-usage-big-table-edition/",
    "date": "2025-02-04T00:00:00.000Z"
  },
  {
    "title": "Opinions for Writing Good CSS",
    "content": "CSS can be hard and frustrating for beginners. The nature of the language is so different from traditional programming languages. While it’s easy to learn the…",
    "url": "https://andrewwalpole.com/blog/opinions-for-writing-good-css/",
    "date": "2025-02-06T00:00:00.000Z"
  },
  {
    "title": "“Dots” Custom Element (aka Web Component)",
    "content": "Please accept my half-hearted apology for the awkward title. Web Components are hot right now but the name is considered harmful according to Mayank. I think…",
    "url": "https://dbushell.com/2024/06/12/docs-custom-element-web-component/",
    "date": "2025-02-06T00:00:00.000Z"
  },
  {
    "title": "Organising NPM Build Scripts",
    "content": "I recently took an existing codebase and ported it over to Eleventy. The main purpose was to recreate the website with existing markdown files and CSS. Creating…",
    "url": "https://www.trovster.com/blog/2024/06/organising-npm-build-scripts",
    "date": "2025-02-10T00:00:00.000Z"
  },
  {
    "title": "Why toggle switches suck (and what to do instead)",
    "content": "A couple of weeks ago I appeared as a guest on the Complimentary podcast hosted by Katie Langerman and Anthony Hobday. One of the topics that we…",
    "url": "https://adamsilver.io/blog/why-toggle-switches-suck-and-what-to-do-instead/",
    "date": "2025-02-10T00:00:00.000Z"
  },
  {
    "title": "Simple, fast build tooling with live reload for a non-framework website",
    "content": "Simple, fast build tooling with live reload for a non-framework website I found a nice build tooling setup that can be integrated into…",
    "url": "https://www.alistairshepherd.uk/writing/simple-build-tooling/",
    "date": "2025-02-11T00:00:00.000Z"
  },
  {
    "title": "Why are my live regions not working?",
    "content": "Why are my live regions not working? Posted on Wednesday, 1 May 2024 by Patrick H. Lauke in Design and development Live regions have a reputation for being…",
    "url": "https://tetralogical.com/blog/2024/05/01/why-are-my-live-regions-not-working/",
    "date": "2025-02-11T00:00:00.000Z"
  },
  {
    "title": "Anchor Links and How to Make Them Awesome",
    "content": "Anchor links (also called jump links) are an easy way to provide in-page navigation. For example, a table of contents could use anchor links to take readers…",
    "url": "https://codersblock.com/blog/anchor-links-and-how-to-make-them-awesome/",
    "date": "2025-02-12T00:00:00.000Z"
  },
  {
    "title": "Proxying an Image CDN with Cloudflare workers",
    "content": "Proxying an Image CDN with Cloudflare workers A short intro and code on how you can use Cloudflare workers on Cloudflare's free tier to proxy an…",
    "url": "https://www.alistairshepherd.uk/writing/cloudflare-worker-image-proxy/",
    "date": "2025-02-12T00:00:00.000Z"
  },
  {
    "title": "The anchor element",
    "content": "First alphabetically and first in importance is the HTML <a> element. The <a> element is what makes the World Wide Web a Web…",
    "url": "https://heydonworks.com/article/the-anchor-element/",
    "date": "2025-02-12T00:00:00.000Z"
  },
  {
    "title": "Manual ’till it hurts",
    "content": "I’ve been going buildless—or as Brad crudely puts it, raw-dogging websites on a few projects recently. Not just obviously simple things like Clearleft’s Browser…",
    "url": "https://adactio.com/journal/21397",
    "date": "2025-02-13T00:00:00.000Z"
  },
  {
    "title": "Relative Color Syntax — Basic Use Case",
    "content": "As of last month, Firefox 128’s support of the relative color syntax means we’ve now got support across the board. I’m excited about that as it’s an extremely…",
    "url": "https://frontendmasters.com/blog/relative-color-syntax-basic-use-cases/",
    "date": "2025-02-20T00:00:00.000Z"
  },
  {
    "title": "Iterative Building and Decision Making",
    "content": "Imagine you’re driving a dirt road and you come to a fork. Which way do you go, left or right? This decision is much easier to make if you’ve been traveling…",
    "url": "https://blog.jim-nielsen.com/2024/iterative-building-and-decision-making/",
    "date": "2025-02-24T00:00:00.000Z"
  },
  {
    "title": "The article element",
    "content": "It was a sunny day (in the Southern Hemisphere, possibly?) in October 2014 when HTML5 was officially released. I remember it like it was…",
    "url": "https://heydonworks.com/article/the-article-element/",
    "date": "2025-02-24T00:00:00.000Z"
  },
  {
    "title": "How to add links with a keyboard shortcut in Sublime Text",
    "content": " Last week, I wrote about my Sublime Text setup. I write in markdown a lot. And one thing that’s been missing for me from Sublime is the ability to add a link to…",
    "url": "https://gomakethings.com/how-to-add-links-with-a-keyboard-shortcut-in-sublime-text/",
    "date": "2025-04-15T00:00:00.000Z"
  },
  {
    "title": "Fine-tuning Text Inputs",
    "content": "When building or using HTML forms, we often layer in a variety of additional elements like labels, help text, validation, and JavaScript behaviors…",
    "url": "https://garrettdimon.com/journal/posts/fine-tuning-text-inputs",
    "date": "2025-04-19T00:00:00.000Z"
  },
  {
    "title": "How to redesign a website: step by step guide",
    "content": "Is it time for a website redesign? It’s not just about updating the look - it’s about improving…",
    "url": "https://www.justinmind.com/web-design/website-redesign",
    "date": "2025-04-24T00:00:00.000Z"
  },
  {
    "title": "Double-Pagination in Eleventy",
    "content": "So I recently converted a French blog of mine to Eleventy from a Hugo-powered one (which itself was previously a WordPress…), as one does on a…",
    "url": "https://chriskirknielsen.com/blog/double-pagination-in-eleventy/",
    "date": "2025-04-24T00:00:00.000Z"
  },
  {
    "title": "User journey mapping: guide with tools and examples",
    "content": "User journey maps help us navigate the sometimes choppy waters…",
    "url": "https://www.justinmind.com/ux-design/user-journey-map",
    "date": "2025-05-07T00:00:00.000Z"
  },
  {
    "title": "Customising checkbox question pages with the GOV.UK Prototype Kit and Nunjucks",
    "content": "I've been doing some more prototyping this week, using the excellent GOV.UK Prototype Kit. I needed to recreate a checkbox…",
    "url": "https://www.benjystanton.co.uk/blog/customising-checkbox-question-pages-with-the-gov.uk-prototype-kit-and-nunjucks/",
    "date": "2025-05-07T00:00:00.000Z"
  },
  {
    "title": "Processes and rules make code review less intimidating",
    "content": "Code reviews are, by nature, intimidating. Sometimes even brutal. If you've been in…",
    "url": "https://www.stefanjudis.com/blog/processes-and-rules-make-code-review-less-intimidating/",
    "date": "2025-05-13T00:00:00.000Z"
  },
  {
    "title": "Prompting the Wrong Question",
    "content": "So there I am, working on a bug exclusive to Safari (we’ve all been there). I can’t figure it out so I ask AI, “Hey, this piece of code is not working in…",
    "url": "https://blog.jim-nielsen.com/2024/prompting-the-wrong-question/",
    "date": "2025-05-13T00:00:00.000Z"
  },
  {
    "title": "Styling web components",
    "content": "One of the more common questions I get around Web Components is how to style them. The Shadow DOM is a big part of why Web Components are often hard to style.…",
    "url": "https://gomakethings.com/styling-web-components/",
    "date": "2025-05-19T00:00:00.000Z"
  },
  {
    "title": "Creating Design System-Friendly Snowflakes with Utility Classes",
    "content": "Whilst I was helping EMBL in creating a new Design System based on a brand…",
    "url": "https://alwaystwisted.com/articles/creating-design-system-friendly-snowflakes-with-utility-classes.html",
    "date": "2025-05-19T00:00:00.000Z"
  },
  {
    "title": "::pseudo-elements?",
    "content": "I’ve given it some thought and I’m going to say it. I don’t like pseudo-elements.",
    "url": "https://dbushell.com/2025/05/23/pseudo-elements/",
    "date": "2025-05-28T00:00:00.000Z"
  },
  {
    "title": "Modern layouts with CSS",
    "content": "As I continue to build out my HTML-focused UI library, one of the things I’ve been deep in-the-weeds on recently is modern approaches to layout…",
    "url": "https://gomakethings.com/modern-layouts-with-css/",
    "date": "2025-05-28T00:00:00.000Z"
  },
  {
    "title": "CSS logical properties",
    "content": "Today, I wanted to talk about CSS logical properties, a newer (and arguably better) way to define properties that are directional in nature. Let’s dig in! The…",
    "url": "https://gomakethings.com/css-logical-properties/",
    "date": "2025-05-28T00:00:00.000Z"
  },
  {
    "title": "More myself online",
    "content": "It’s really surprising how many fully remote jobs require mandatory, several-times-a-year travel under the pretense that “face-to-face time is really important…",
    "url": "https://gomakethings.com/more-myself-online/",
    "date": "2025-05-29T00:00:00.000Z"
  },
  {
    "title": "The problem with good design",
    "content": "Last week I ran a Form Design Mastery live call with the UX team at Multiverse. Various members of the team shared their designs for me to review…",
    "url": "https://adamsilver.io/blog/the-problem-with-good-design/",
    "date": "2025-05-29T00:00:00.000Z"
  },
  {
    "title": "Naming conventions for CSS classes",
    "content": "I’m working on a UI library for people who love HTML and modern CSS, and one of the many details I’m currently sweating is naming conventions for CSS classes…",
    "url": "https://gomakethings.com/naming-conventions-for-css-classes/",
    "date": "2025-05-30T00:00:00.000Z"
  },
  {
    "title": "How to write error messages that actually help users rather than frustrate them",
    "content": "One of the most consistently neglected parts of today’s user experiences is our handling of errors. We’re so busy designing the happy paths through our products…",
    "url": "https://piccalil.li/blog/how-to-write-error-messages-that-actually-help-users-rather-than-frustrate-them/",
    "date": "2025-05-30T00:00:00.000Z"
  },
  {
    "title": "My Figma design system",
    "content": "Why I created the design system I’ve been pushing pixels since 2005 and have studied hundreds of design systems over the years, even before they were called…",
    "url": "https://www.adhamdannaway.com/portfolio/figma-design-system",
    "date": "2025-06-01T00:00:00.000Z"
  },
  {
    "title": ":nth-next-sibling? No need.",
    "content": "Yesterday, I discovered a new wish I had in CSS: when selecting the next few siblings of an element, instead of having to do…",
    "url": "https://chriskirknielsen.com/blog/nth-next-sibling-no-need/",
    "date": "2025-06-04T00:00:00.000Z"
  },
  {
    "title": "Worrying about the future of interaction design",
    "content": "A weeknote starting 9 September 2024. This post from Steve Messer got me thinking about the future of interaction design again this week. With the rise of tools…",
    "url": "https://www.benjystanton.co.uk/blog/worrying-about-the-future-of-interaction-design/",
    "date": "2025-06-04T00:00:00.000Z"
  },
  {
    "title": "Limitation Breeds Creativity: A Study in Composition with Custom Properties",
    "content": "It’s been a little while since I’ve played around with making creative stuff with CSS just for fun. My trip to State of the Browser conference at the weekend…",
    "url": "https://css-irl.info/limitation-breeds-creativity/",
    "date": "2025-06-04T00:00:00.000Z"
  },
  {
    "title": "Optimize for optionality and build towards checkpoints",
    "content": "In a project management-themed Hackers Incorporated episode, Adam Wathan introduced derisking projects with save points. The entire episode is definitely worth…",
    "url": "https://sebastiandedeyne.com/optimize-for-optionality-and-build-towards-checkpoints",
    "date": "2025-06-08T00:00:00.000Z"
  },
  {
    "title": "The order of accessible name computation steps",
    "content": "I try to be a good web citizen, and keep things accessible. Now, I'm no expert, but there are some things web developers should check at least: Do images have…",
    "url": "https://www.stefanjudis.com/today-i-learned/the-order-of-accessible-name-computation-steps/",
    "date": "2025-06-08T00:00:00.000Z"
  },
  {
    "title": "Building Search Index with Eleventy",
    "content": "One of the features that I’m quite happy about on my new website is the built-in search functionality and how the search index gets built for it. You can test…",
    "url": "https://arielsalminen.com/2025/building-search-index-with-eleventy/",
    "date": "2025-06-11T00:00:00.000Z"
  },
  {
    "title": "The world we're designing",
    "content": "On the topic of craft and web development, over on Bluesky Kameron Hurley shared this excerpt from the book Stolen Focus… One day, James Williams—the former…",
    "url": "https://gomakethings.com/the-world-were-designing/",
    "date": "2025-06-11T00:00:00.000Z"
  },
  {
    "title": "My favourite 3 lines of CSS",
    "link": "https://piccalil.li/blog/my-favourite-3-lines-of-css/",
    "pubDate": "Wed, 09 Jul 2025 21:56:06 GMT",
    "content": "In Every Layout, we wrote about The Stack. It’s a marriage of Heydon’s Lobotomised Owl selector and my method of managing Flow and Rhythm with CSS Custom…",
    "date": "2025-07-09T21:56:06.000Z"
  },
  {
    "title": "Easy dark mode for your website or web app",
    "link": "https://gomakethings.com/easy-dark-mode-for-your-website-or-web-app/",
    "pubDate": "Tue, 01 Jul 2025 07:39:49 GMT",
    "content": "Last week, I added a dark mode to Go Make Things, the Vanilla JS Toolkit, and the Lean Web. Today, I want to show you how I did it. How dark mode works Every…",
    "date": "2025-07-01T07:39:49.000Z"
  },
  {
    "title": "SVG Optimization and Accessibility Basics",
    "link": "https://dbushell.com/2025/06/25/svg-optimization-and-accessibility-basics/",
    "pubDate": "Tue, 01 Jul 2025 07:36:08 GMT",
    "content": "Wednesday 25 Jun 2025 SVG (Scalable Vector Graphics) are now commonplace on the web. When I wrote Resolution Independence With SVG for Smashing Magazine in 2012…",
    "date": "2025-07-01T07:36:08.000Z"
  },
  {
    "title": "Rethinking modular CSS and build-free design systems",
    "link": "https://gomakethings.com/rethinking-modular-css-and-build-free-design-systems/",
    "pubDate": "Sun, 29 Jun 2025 09:32:51 GMT",
    "content": "One of my big goals with Kelp, my UI library for people who love HTML, was build-free customization. I want to use the best of modern HTML, CSS, and JavaScript…",
    "date": "2025-06-29T09:32:51.000Z"
  },
  {
    "title": "Stop animating everything!",
    "link": "https://gomakethings.com/stop-animating-everything/",
    "pubDate": "Sun, 20 Jul 2025 10:44:35 GMT",
    "content": "Earlier this week, a friend shared a “really cool website” from a design and dev agency (I’m not going to link to it, don’t ask). Nearly every single element on…",
    "date": "2025-07-20T10:44:35.000Z"
  },
  {
    "title": "Croissant! Building a No-Framework Web App",
    "link": "https://dbushell.com/2025/07/11/croissant-no-framework-web-app/",
    "pubDate": "Fri, 11 Jul 2025 22:53:13 GMT",
    "content": "Friday 11 Jul 2025 If you subscribe to my notes you’ll know I’ve gone a little crazy building an RSS aggregator web app over the past week. My side project…",
    "date": "2025-07-11T22:53:13.000Z"
  },
  {
    "title": "Getting the index in a for...of loop",
    "link": "https://gomakethings.com/getting-the-index-in-a-for...of-loop/",
    "pubDate": "Sun, 20 Jul 2025 10:46:40 GMT",
    "content": "I love for...of loops! I find them nice and simple. They’re more clear than an old-school forloop, and in my opinion easier to read than an…",
    "date": "2025-07-20T10:46:40.000Z"
  },
  {
    "title": "A revisit of the Every Layout sidebar with :has() and selector performance",
    "link": "https://piccalil.li/blog/a-revisit-of-the-every-layout-sidebar-with-has-and-selector-performance/",
    "pubDate": "Sun, 20 Jul 2025 10:10:51 GMT",
    "content": "Every Layout’s Sidebar exemplifies a quantum CSS layout, perhaps better than any other layout we offer. It is neither a two column layout, comprising elements…",
    "date": "2025-07-20T10:10:51.000Z"
  },
  {
    "title": "Controlling spacing in modern CSS layouts",
    "link": "https://gomakethings.com/controlling-spacing-in-modern-css-layouts/",
    "pubDate": "Wed, 09 Jul 2025 21:59:16 GMT",
    "content": "Over the last week, we’ve looked at how Kelp UI implements four different layouts with modern CSS: the container layout pattern, the cluster layout, the split…",
    "date": "2025-07-09T21:59:16.000Z"
  },
  {
    "title": "Modular CSS Redux",
    "link": "https://gomakethings.com/modular-css-redux/",
    "pubDate": "Sun, 29 Jun 2025 09:35:56 GMT",
    "content": "They say the best way to get an answer to a technical question is to post the wrong answer on the internet! Yesterday, I wrote about modular CSS architecture…",
    "date": "2025-06-29T09:35:56.000Z"
  },
  {
    "title": "We migrated our site to Eleventy and increased performance by 24%",
    "url": "https://etch.co/blog/we-migrated-our-site-to-eleventy-and-increased-performance-by-24-percent",
    "content": "How choosing the right tool for the job led to faster load times and fewer dependencies.\nOur little content site etch.co was built with Next.js until we…",
    "date": "2025-07-23T19:46:15.000Z"
  },
  {
    "title": "Why I’m Writing Pure HTML & CSS in 2025",
    "url": "https://joeldare.com/why-im-writing-pure-html-and-css-in-2025",
    "content": "Imagine a web page that loads instantly, deploys effortlessly, and never needs a security update. I’m using pure HTML and CSS to accomplish all that and to…",
    "date": "2025-07-23T19:46:15.000Z"
  },
  {
    "title": "Getting the index in a for...of loop",
    "url": "https://gomakethings.com/getting-the-index-in-a-for...of-loop/",
    "content": "I love for...of loops! I find them nice and simple. They’re more clear than an old-school forloop, and in my opinion easier to read than an…",
    "date": "2025-07-20T10:46:40.000Z"
  },
  {
    "title": "Stop animating everything!",
    "url": "https://gomakethings.com/stop-animating-everything/",
    "content": "Earlier this week, a friend shared a “really cool website” from a design and dev agency (I’m not going to link to it, don’t ask). Nearly every single element on…",
    "date": "2025-07-20T10:44:35.000Z"
  },
  {
    "title": "A revisit of the Every Layout sidebar with :has() and selector performance",
    "url": "https://piccalil.li/blog/a-revisit-of-the-every-layout-sidebar-with-has-and-selector-performance/",
    "content": "Every Layout’s Sidebar exemplifies a quantum CSS layout, perhaps better than any other layout we offer. It is neither a two column layout, comprising elements…",
    "date": "2025-07-20T10:10:51.000Z"
  },
  {
    "title": "Croissant! Building a No-Framework Web App",
    "url": "https://dbushell.com/2025/07/11/croissant-no-framework-web-app/",
    "content": "Friday 11 Jul 2025 If you subscribe to my notes you’ll know I’ve gone a little crazy building an RSS aggregator web app over the past week. My side project…",
    "date": "2025-07-11T22:53:13.000Z"
  },
  {
    "title": "Controlling spacing in modern CSS layouts",
    "url": "https://gomakethings.com/controlling-spacing-in-modern-css-layouts/",
    "content": "Over the last week, we’ve looked at how Kelp UI implements four different layouts with modern CSS: the container layout pattern, the cluster layout, the split…",
    "date": "2025-07-09T21:59:16.000Z"
  },
  {
    "title": "My favourite 3 lines of CSS",
    "url": "https://piccalil.li/blog/my-favourite-3-lines-of-css/",
    "content": "In Every Layout, we wrote about The Stack. It’s a marriage of Heydon’s Lobotomised Owl selector and my method of managing Flow and Rhythm with CSS Custom…",
    "date": "2025-07-09T21:56:06.000Z"
  },
  {
    "title": "Easy dark mode for your website or web app",
    "url": "https://gomakethings.com/easy-dark-mode-for-your-website-or-web-app/",
    "content": "Last week, I added a dark mode to Go Make Things, the Vanilla JS Toolkit, and the Lean Web. Today, I want to show you how I did it. How dark mode works Every…",
    "date": "2025-07-01T07:39:49.000Z"
  },
  {
    "title": "SVG Optimization and Accessibility Basics",
    "url": "https://dbushell.com/2025/06/25/svg-optimization-and-accessibility-basics/",
    "content": "Wednesday 25 Jun 2025 SVG (Scalable Vector Graphics) are now commonplace on the web. When I wrote Resolution Independence With SVG for Smashing Magazine in 2012…",
    "date": "2025-07-01T07:36:08.000Z"
  },
  {
    "title": "The <details> and <summary> elements are getting an upgrade - Stephanie Stimac's Blog",
    "url": "https://blog.stephaniestimac.com/posts/2024/10/html-details-and-summary-update/",
    "content": "The <details> and <summary> elements are getting an upgrade 01 Nov 2024 Form controls are notoriously difficult to style, something the web community has been…",
    "date": "2025-08-06T15:40:57.000Z"
  },
  {
    "title": "Your CSS reset should be layered",
    "url": "https://www.mayank.co/blog/css-reset-layer/",
    "content": "Published on November 2, 2024 Cascade layers recently reached the completely arbitrary “baseline widely available” milestone, which means they have been…",
    "date": "2025-08-06T11:04:08.000Z"
  },
  {
    "title": "7 Simple Button Design Tips That Make a Big Impact",
    "url": "https://medium.com/design-bootcamp/7-simple-button-design-tips-that-make-a-big-impact-3cefcdc2d9a2",
    "content": "While you are working on a UI/UX design project, I have developed a set of practical tips for designing a clickable button that helps me maintain design…",
    "date": "2025-08-05T21:19:05.000Z"
  },
  {
    "title": "The blockquote element",
    "url": "https://heydonworks.com/article/the-blockquote-element/",
    "content": "14th October 2024 The thing about magazines—physical, printed magazines, I mean—is it’s very easy to skip past content. Between your thumb and gravity, weeks of…",
    "date": "2025-08-05T19:31:38.000Z"
  },
  {
    "title": "Prototyping Magic Tricks and Software",
    "url": "https://blog.jim-nielsen.com/2024/prototyping-magic-and-software/",
    "content": "In Penn & Teller’s Masterclass (no. 12 “Principles of Performing”) they explain how one of their favorite ways to design a magic trick is to come up with an…",
    "date": "2025-07-29T10:06:00.000Z"
  },
  {
    "title": "Why GOV.UK's Exit this Page component doesn't use the Escape key",
    "url": "https://beeps.website/blog/2024-10-09-why-govuk-exit-this-page-doesnt-use-escape/",
    "content": "Content warning: This blog post references domestic abuse and violence but doesn’t go into specific detail. I’m not an expert in that topic at all, so I may not…",
    "date": "2025-07-29T10:01:38.000Z"
  },
  {
    "title": "Building my new website: A modern approach to font fallbacks with font property adjustments - Nic Chan",
    "url": "https://www.nicchan.me/blog/building-my-new-website-part-6-font-fallbacks/",
    "content": "This is a post in a series about building my new website, check out the previous post in this series. A note from the present day Hi, it’s present-day Nic here.…",
    "date": "2025-07-28T18:53:22.000Z"
  }
]