[
  {
    "quote": "I worked closely with Juan when he was developing the UI/UX for two Intelliflo products while I had the front end lead role. Juan is a talented UI/UX professional with knowledge in user experience, web design and software development that allows him to do the perfect bridge between the end user and the technical teams. Not only his technical skills are impressive but he is also a great colleague that clearly contributes to a better working environment and improved communication in the team. It was a pleasure working with him and I would recommend him without reservations to every team that has the ambition to create a great product.",
    "cite": "Filipe Velosa",
    "img": "filipe.jpg",
    "company": "Intelliflo"
  },
  {
    "quote": "I had the pleasure of working with Juan on Intelliflo's Developer Platform (both Developer Portal and Application Store). He demonstrated incredibly ingenuity by getting up to speed quite rapidly and creating amazing functional prototypes during the initial phases of the project. During project implementation, he worked side-by-side with the development team, leading the design process and providing a extremely refined atomic design system (based of pattern lab). Daily, he helped the team solving styling and/or cross-browser issues showing great knowledge both of modern web-design patterns and respective polyfills. Besides Juan's professionalism, the key factor that set him apart is his rock solid understanding of proper user experience. Commonly web-design is simply focused on \"making things look pretty\" disregarding the overall experience. Engagement is not only about beauty and Juan clearly understands this and his work and ideas are clearly a demonstration of that.",
    "cite": "John Louros",
    "img": "john.jpg",
    "company": "Intelliflo"
  },
  {
    "quote": "I had the pleasure of working with Juan and he is an absolute pleasure to work with. He is very thorough, adapts and changes to altering requirements quickly, he cares about responsive design and accessibility issues and good css patterns, not scared to get in and learn JavaScript and stuff not required of him. He is a delightful person with a great future ahead of him.",
    "cite": "Vincent Farah",
    "img": "vince.jpg",
    "company": "Intelliflo"
  },
  {
    "quote": "Juan's job title isn't accurate. And that's not surprising because his skills and expertise are impossible to capture in a word or three. I've worked alongside Juan for a year on some of our most audacious projects. I'd call Juan a 'Specialist Generalist' - part designer, part front-end developer, part behaviourist. We leveraged Juan's unique skills in our small, multi-disciplinary hack teams to prototype and test some of our most adventurous business solutions. Juan's infectious energy and his creative approach make him a super valuable. Hire this guy.",
    "cite": "Steve Molesworth",
    "img": "steve-molesworth.jpg",
    "company": "G2G3 Digital"
  },
  {
    "quote": "Juan is the kind of guy you can drop in the deep end of a project and will get up to speed lightening fast, without being flustered, whilst maintaining his steely professionalism at all times. I know this because I did exactly that to the poor chap. He is extremely thorough and asks a lot of really good questions. I don't think I've ever heard him complain about anything, ever.",
    "cite": "Chris Taylor",
    "img": "chris-taylor.jpg",
    "company": "G2G3 Digital"
  },
  {
    "quote": "Over the last 3 months I've been working with Juan on a large Front End end project which has been extremely fast paced, and it's been a pleasure working with him. The environment included front end frameworks which were not so familiar to Juan at the beginning. But he took the challenge of learning these really well, mainly due to his tenacious attitude towards his work and his passion to always want to learn more. Juan has been a dependable colleague, and I would certainly work with him again.",
    "cite": "Mike Haddon",
    "img": "mike-haddon.jpg",
    "company": "Virgin Wines"
  },
  {
    "quote": "We have worked on many different projects with Juan; from making our site responsive, executing a CMS site migration and implementing a new site design to name a few. Juan is always responsive, patient and finds a technical solution to deliver our web development on time and in budget. He is always a pleasure to work with.",
    "cite": "Aahuti Rai",
    "img": "aahuti-rai.jpg",
    "company": "Four Points Consulting Ltd."
  },
  {
    "quote": "I had the pleasure of managing Juan for around a year while at Motortrak. Juan was a great all round front end developer who is very up to date on his skill sets and is always looking to improve and learn. He had great attention to details and always fed back good input towards projects. I would happily recommend Juan as a solid all round developer.",
    "cite": "Ziggy Fried-Jones",
    "img": "ziggy-fried-jones.jpg",
    "company": "Motortrak Ltd."
  }
]
