[
  {
    "quote": "I asked Juan to redesign Property With Potential with the intent of improving the mobile experience and increasing user engagement. However, I needed <b>more than just a designer</b> since I wanted it delivered in a templating language that was compatible with our system, and to use Tailwind CSS. Juan rose to the challenge, learning Tailwind, introducing me to Alpine JS, and continuously delivering to Netlify and GitLab. There's nothing better as a developer than to work with someone that just 'gets it'; someone who can collaborate, work independently, and deliver. The new design has <b>significantly improved our performance</b> and <b>accessibility metrics</b>, and improved our ad revenue. If you need someone to hit the ground running and work with your existing team, <b>hire him</b>.",
    "cite": "Jon Canning",
    "img": "/v1617039926/jon-canning.jpg",
    "company": "Property With Potential"
  },
  {
    "quote": "Juan is an <b>excellent front-end developer</b> who can rapidly adjust to the demands of a project. Juan joined the agile team at Signet to contribute to delivery within tight schedules. He was quick to provide accurate estimates and have a <b>pragmatic approach</b> to provide solutions. Juan has very <b>strong CSS knowledge</b>. Juan is great to work with, being a pleasant person.",
    "cite": "Mark Dathorne",
    "img": "/v1601393042/mark-dathorne_zil9cq.jpg",
    "company": "Signet Jewelers"
  },
  {
    "quote": "Juan is an <b>excellent Senior Front-End Web developer</b> with a vast amount of knowledge and expertise. I worked with him on a whole website rebuild at the Chartered Management Institute in which he took a lead on building reusable components for the website. Juan is an <b>expert in HTML, CSS, Jquery, git</b> and many other modern front end development tools and I would highly recommend him to anyone.",
    "cite": "Harry Tate",
    "img": "/v1601392444/harry-tate_rmrgar.jpg",
    "company": "Chartered Management Institute"
  },
  {
    "quote": "Worked with Juan at Signet. He is an <b>amazingly skilled developer</b> and has very good communication skills. Juan would be an <b>asset to any team</b>.",
    "cite": "Geoffrey Ofori",
    "img": "geoffrey-ofori_jxnn7y.jpg",
    "company": "Signet Jewelers"
  },
  {
    "quote": "I had the pleasure of working alongside Juan for a few months on a major CMS integration project. Juan has <b>incredible attention to detail</b> and this coupled with his <b>knowledge of web standards, accessibility and user experience</b> make him a fantastic asset to any team. Along with his great technical skills Juan also has the ability to take responsibility for large pieces of functionality and deliver them to the <b>highest standard</b>. He has the ability to not only manage large complex builds but deal with last-minute requests and design changes. Juan is a pleasure to be around and I hope I have the pleasure of working with him again.",
    "cite": "Chris Benge",
    "img": "/v1601392007/chris-benge_haw8kq.jpg",
    "company": "Signet Jewelers"
  },
  {
    "quote": "We were incredibly fortunate to have Juan as part of our team this year. He played a vital role in helping us deliver some major redesign projects, often taking large ownership of the redevelopment of our site header and product detail page. He has <b>incredible attention to detail</b>, picking up on the slightest design inconsistencies during the development phase, and worked with us to ensure that we <b>delivered to a very high standard</b>. He brought <b>strong knowledge of web standards, user experience and accessibility</b> to the team and I found his input invaluable when reviewing the new and existing UI. Juan was a pleasure to work with and I was very sad to see him go! I have no doubt that he would prove to be a valuable asset for any development team looking to employ him in the future. Fingers crossed he might work with us again!",
    "cite": "Tony Ball",
    "img": "/v1601392158/tony-ball_wgmiva.jpg",
    "company": "Signet Jewelers"
  },
  {
    "quote": "I worked closely with Juan when he was developing the UI/UX for two Intelliflo products while I had the front end lead role. Juan is a <b>talented UI/UX professional</b> with knowledge in user experience, web design and software development that allows him to do the <b>perfect bridge between the end user and the technical teams</b>. Not only his technical skills are impressive but he is also a great colleague that clearly contributes to a better working environment and improved communication in the team. It was a <b>pleasure working with him</b> and I would recommend him without reservations to every team that has the ambition to create a great product.",
    "cite": "Filipe Velosa",
    "img": "filipe.jpg",
    "company": "Intelliflo"
  },
  {
    "quote": "I had the pleasure of working with Juan on Intelliflo's Developer Platform (both Developer Portal & Application Store). He demonstrated <b>incredible ingenuity</b> by getting up to speed quite rapidly and creating amazing <b>functional prototypes</b> during the initial phases of the project. During project implementation, he worked side-by-side with the development team, <b>leading the design process</b> and providing a extremely refined atomic design system (based of pattern lab). Daily, he helped the team <b>solving styling and/or cross-browser issues</b> showing great knowledge both of modern web-design patterns and respective polyfills. Besides Juan's professionalism, the key factor that set him apart is his rock solid understanding of proper user experience. Commonly web-design is simply focused on \"making things look pretty\" disregarding the overall experience. Engagement is not only about beauty and Juan clearly understands this and his work and ideas are clearly a demonstration of that.",
    "cite": "John Louros",
    "img": "john.jpg",
    "company": "Intelliflo"
  },
  {
    "quote": "I had the pleasure of working with Juan and he is an <b>absolute pleasure to work with</b>. He is very thorough, adapts and changes to altering requirements quickly, he cares about <b>responsive design and accessibility issues</b> and good CSS patterns, not scared to get in and learn JavaScript and stuff not required of him. He is a <b>delightful person</b> with a great future ahead of him.",
    "cite": "Vincent Farah",
    "img": "vince.jpg",
    "company": "Intelliflo"
  },
  {
    "quote": "Juan's job title isn't accurate. And that's not surprising because his skills and expertise are impossible to capture in a word or three. I've worked alongside Juan for a year on some of our most audacious projects. I'd call Juan a 'Specialist Generalist' - part designer, part front-end developer, part behaviourist. We leveraged Juan's unique skills in our small, multi-disciplinary hack teams to prototype and test some of our most adventurous business solutions. Juan's <b>infectious energy and his creative approach</b> make him a super valuable. Hire this guy.",
    "cite": "Steve Molesworth",
    "img": "steve-molesworth.jpg",
    "company": "G2G3 Digital"
  },
  {
    "quote": "Juan is the kind of guy you can drop in the deep end of a project and will get up to speed lightening fast, without being flustered, whilst maintaining his <b>steely professionalism</b> at all times. I know this because I did exactly that to the poor chap. He is <b>extremely thorough</b> and asks a lot of really good questions. I don't think I've ever heard him complain about anything, ever.",
    "cite": "Chris Taylor",
    "img": "chris-taylor.jpg",
    "company": "G2G3 Digital"
  },
  {
    "quote": "Over the last 3 months I've been working with Juan on a large Front End end project which has been extremely fast paced, and it's been a <b>pleasure working with him</b>. The environment included front end frameworks which were not so familiar to Juan at the beginning. But he took the challenge of learning these really well, mainly due to his <b>tenacious attitude towards his work</b> and his passion to always want to learn more. Juan has been a <b>dependable colleague</b>, and I would certainly work with him again.",
    "cite": "Mike Haddon",
    "img": "mike-haddon.jpg",
    "company": "Virgin Wines"
  },
  {
    "quote": "We have worked on many different projects with Juan; from making our site responsive, executing a CMS site migration and implementing a new site design to name a few. Juan is always <b>responsive, patient</b> and finds a technical solution to deliver our web development on time and in budget. He is always a <b>pleasure to work with</b>.",
    "cite": "Aahuti Rai",
    "img": "aahuti-rai.jpg",
    "company": "Four Points Consulting Ltd."
  },
  {
    "quote": "I had the pleasure of managing Juan for around a year while at Motortrak. Juan was a <b>great all round front end developer</b> who is very up to date on his skill sets and is always looking to improve and learn. He had great <b>attention to detail</b> and always fed back good input towards projects. I would happily recommend Juan as a solid all round developer.",
    "cite": "Ziggy Fried-Jones",
    "img": "ziggy-fried-jones.jpg",
    "company": "Motortrak Ltd."
  }
]
